{
  "VII": {
    "id": "VII",
    "title": "Đại hội đại biểu toàn quốc lần thứ VII",
    "time": "24 - 27/06/1991",
    "location": "Hà Nội",
    "heroImage": "/images/dai-hoi-7-1.jpg",
    "context": [
      "Sau 5 năm thực hiện đường lối đổi mới do Đại hội VI (1986) đề ra, đất nước ta đã đạt được những kết quả bước đầu quan trọng. Nền kinh tế dần thoát khỏi khủng hoảng từng phần, sản xuất có bước tăng trưởng, hàng hóa lưu thông tốt hơn, đời sống nhân dân được cải thiện.",
      "Tuy nhiên, tình hình kinh tế – xã hội nước ta vẫn còn nhiều khó khăn, hạn chế. Nền kinh tế chưa thật sự ổn định, tốc độ lạm phát còn cao, cơ cấu sản xuất chậm đổi mới. Cơ chế quản lý kinh tế mới còn thiếu đồng bộ. Tệ nạn xã hội, tham nhũng và quan liêu vẫn diễn ra ở nhiều nơi.",
      "Trong bối cảnh đó, yêu cầu đặt ra đối với Đảng và Nhà nước là phải tiếp tục công cuộc đổi mới một cách toàn diện và đồng bộ hơn nữa, tạo ra cơ sở lý luận và thực tiễn vững chắc cho con đường đi lên chủ nghĩa xã hội ở Việt Nam, đồng thời xây dựng một Cương lĩnh mới và Chiến lược phát triển kinh tế – xã hội dài hạn nhằm định hướng cho sự phát triển của đất nước trong giai đoạn mới."
    ],
    "contentHighlights": [
      {
        "title": "Cương lĩnh 1991",
        "description": "Thông qua \"Cương lĩnh xây dựng đất nước trong thời kỳ quá độ lên chủ nghĩa xã hội (1991)\", xác định con đường đi lên chủ nghĩa xã hội ở Việt Nam, nêu rõ mục tiêu, phương hướng và những nhiệm vụ cơ bản của thời kỳ quá độ lên CNXH."
      },
      {
        "title": "Chiến lược KTXH đến năm 2000",
        "description": "Thông qua \"Chiến lược ổn định và phát triển kinh tế – xã hội đến năm 2000\", đề ra mục tiêu xóa đói giảm nghèo, phát triển kinh tế, nâng cao đời sống nhân dân và chuyển dịch cơ cấu kinh tế theo hướng công nghiệp hóa."
      },
      {
        "title": "Các Hội nghị Trung ương và Nghị quyết",
        "description": "Sau Đại hội VII, Đảng đã tổ chức nhiều Hội nghị Trung ương và ban hành các nghị quyết quan trọng nhằm cụ thể hóa Cương lĩnh 1991 và Chiến lược phát triển kinh tế – xã hội đến năm 2000. Các nghị quyết này tập trung vào đẩy mạnh công nghiệp hóa, hiện đại hóa đất nước và xây dựng giai cấp công nhân trong giai đoạn mới."
      }
    ],
    "fullContentSummary": [
      "# Điểm mới nổi bật của Đại hội VII",
      "Đại hội VII thông qua **hai văn kiện quan trọng**:",
      "- *Cương lĩnh xây dựng đất nước trong thời kỳ quá độ lên chủ nghĩa xã hội (1991)*",
      "- *Chiến lược, ổn định và phát triển kinh tế- xã hội đến năm 2000*",
      "## Cương lĩnh xây dựng đất nước trong thời kỳ quá độ lên chủ nghĩa xã hội (1991)",
      "**Cương lĩnh 1991** gồm **4 phần**:",
      "1. Quá trình cách mạng và những bài học kinh nghiệm",
      "2. Quá độ lên chủ nghĩa xã hội ở nước ta",
      "3. Những định hướng lớn về chính sách kinh tế, xã hội, quốc phòng - an ninh, đối ngoại",
      "4. Hệ thống chính trị và vai trò lãnh đạo của Đảng",
      "Cương lĩnh nêu ra **7 phương hướng lớn xây dựng chủ nghĩa xã hội**:",
      "- **Xây dựng Nhà nước xã hội chủ nghĩa**",
      "- **Phát triển lực lượng sản xuất**, công nghiệp hóa đất nước theo hướng hiện đại gắn liền với phát triển một nền nông nghiệp toàn diện là **nhiệm vụ trung tâm**",
      "- **Thiết lập từng bước quan hệ sản xuất xã hội chủ nghĩa** từ thấp đến cao với sự đa dạng về hình thức sở hữu",
      "- **Phát triển nền kinh tế hàng hóa nhiều thành phần** theo định hướng xã hội chủ nghĩa, vận hành theo cơ chế thị trường có sự quản lý của Nhà nước",
      "- **Tiến hành cách mạng xã hội chủ nghĩa trên lĩnh vực tư tưởng, văn hóa**, làm cho thế giới quan Mác-Lênin, tư tưởng, đạo đức Hồ Chí Minh giữ vị trí chủ đạo trong đời sống tinh thần xã hội",
      "- **Thực hiện chính sách đại đoàn kết dân tộc**",
      "- **Thực hiện hai nhiệm vụ chiến lược**: xây dựng và bảo vệ Tổ quốc",
      "> Một trong các phương hướng nổi bật:",
      "> *“Phát triển lực lượng sản xuất, công nghiệp hóa đất nước theo hướng hiện đại gắn liền với phát triển một nền nông nghiệp toàn diện là nhiệm vụ trung tâm.”*",
      "Lần đầu tiên khái niệm **“công nghiệp hoá”** được nêu chính thức trong Cương lĩnh của Đảng và đi kèm với cụm **“theo hướng hiện đại”**, đánh dấu bước ngoặt trong tư duy **công nghiệp hoá, hiện đại hoá** đất nước.",
      "## Chiến lược ổn định và phát triển kinh tế – xã hội đến năm 2000 ",
      "Mục tiêu tổng quát: đưa đất nước ra khỏi khủng hoảng, ổn định kinh tế – xã hội, vượt qua tình trạng nghèo nàn, kém phát triển.",
      "Quan điểm chỉ đạo: phát triển kinh tế – xã hội gắn với củng cố độc lập dân tộc và xây dựng chủ nghĩa xã hội.",
      "Xây dựng xã hội: nhân dân làm chủ, công bằng, nhân ái, có văn hóa, kỷ cương, xoá bỏ áp bức, bất công; đảm bảo cuộc sống ấm no, tự do, hạnh phúc cho mọi người.",
      "Phát triển nền kinh tế hàng hóa nhiều thành phần, đa dạng hình thức sở hữu và tổ chức kinh doanh, vận hành theo cơ chế thị trường có sự quản lý của Nhà nước.",
      "Mục tiêu và động lực phát triển là **vì con người, do con người**, giải phóng sức sản xuất và khai thác tối đa tiềm năng của cá nhân, tập thể và cộng đồng.",
      "## Hội nghị Trung ương và Nghị quyết nổi bật",
      "**Hội nghị Trung ương 7 khóa VII (30/7/1994)** ban hành **Nghị quyết 07‑NQ/HNTW** về công nghiệp hóa, hiện đại hóa (CNH, HĐH) và xây dựng giai cấp công nhân.",
      "- **Công nghiệp hóa, hiện đại hóa** là quá trình chuyển đổi toàn diện các hoạt động sản xuất, kinh doanh, dịch vụ và quản lý từ lao động thủ công sang sử dụng công nghệ và phương pháp hiện đại, nâng cao năng suất lao động xã hội.",
      "- Mục tiêu: chuyển Việt Nam từ xã hội nông nghiệp lạc hậu sang xã hội công nghiệp với cơ sở vật chất – kỹ thuật hiện đại, cơ cấu kinh tế hợp lý, quan hệ sản xuất tiến bộ, đời sống vật chất và tinh thần cao, quốc phòng – an ninh vững chắc, dân giàu, nước mạnh, xã hội công bằng, văn minh.",
      "- Xây dựng **giai cấp công nhân**: phát triển về số lượng, trình độ, giác ngộ chính trị và tư tưởng, năng lực tiếp thu và sáng tạo công nghệ mới, lao động đạt năng suất và chất lượng cao.",
      "- Nâng cao **năng lực lãnh đạo của Đảng**, quản lý của Nhà nước, phát huy vai trò Mặt trận và các đoàn thể nhân dân trong công nghiệp hóa, hiện đại hóa.",
      "→ Nghị quyết xác định rõ **bản chất, nội dung, phương hướng và động lực** của công nghiệp hóa, hiện đại hóa đất nước."
    ],
    "significance": [
      " Giai đoạn này đã đặt nền móng quan trọng để chuyển đất nước sang thời kỳ đẩy mạnh công nghiệp hóa, hiện đại hóa, chuẩn bị điều kiện để Đại hội VIII (1996) đề ra chiến lược phát triển mới trong thời kỳ công nghiệp hoá, hiện đại hoá đất nước."
    ],
    "media": {
      "images": [
        {
          "src": "/images/dai-hoi-7-1.jpg",
          "caption": "Toàn cảnh Đại hội VII"
        },
        {
          "src": "/images/dai-hoi-7-2.jpg",
          "caption": "Toàn cảnh Đại hội VII (Ảnh đen trắng)"
        }
      ],
      "videoUrl": "/video/daihoi7.mp4"
    }
  },
  "VIII": {
    "id": "VIII",
    "title": "Đại hội đại biểu toàn quốc lần thứ VIII",
    "time": "28/06 - 01/07/1996",
    "location": "Hà Nội",
    "heroImage": "/images/dai-hoi-8-1.jpg",
    "context": [
      "Quốc tế: Cách mạng khoa học và công nghệ phát triển mạnh, nhưng chủ nghĩa xã hội hiện thực đang lâm vào thoái trào.",
      "Trong nước: Sau 10 năm đổi mới (1986-1996), đất nước đã đạt được những thắng lợi bước đầu rất quan trọng. Lạm phát được kiềm chế (từ 67,1% năm 1991 xuống 12,7% năm 1995).",
      "Đại hội tổng kết 10 năm đổi mới, khẳng định nước ta đã ra khỏi khủng hoảng kinh tế-xã hội, cho phép chuyển sang thời kỳ mới đẩy mạnh CNH, HĐH đất nước."
    ],
    "contentHighlights": [
      {
        "title": "Tổng kết 10 năm Đổi mới",
        "description": "Tổng kết 10 năm đổi mới và rút ra 6 bài học kinh nghiệm chủ yếu, khẳng định con đường đổi mới là đúng đắn."
      },
      {
        "title": "Bước ngoặt CNH, HĐH",
        "description": "Đánh dấu bước ngoặt, đưa đất nước sang thời kỳ mới: đẩy mạnh công nghiệp hóa, hiện đại hóa."
      },
      {
        "title": "Mục tiêu Xã hội",
        "description": "Bổ sung đặc trưng tổng quát về mục tiêu XHCN là: 'Dân giàu, nước mạnh, xã hội công bằng, văn minh'."
      },
      {
        "title": "Quốc sách hàng đầu",
        "description": "Hội nghị Trung ương 2 (12-1996) nhấn mạnh coi giáo dục-đào tạo cùng với khoa học và công nghệ là quốc sách hàng đầu."
      }
    ],
    "fullContentSummary": [
      "Đại hội VIII rút ra sáu bài học chủ yếu, bao gồm: Giữ vững mục tiêu ĐLDT và CNXH; Kết hợp đổi mới kinh tế (trọng tâm) với đổi mới chính trị; Xây dựng kinh tế hàng hoá nhiều thành phần; Phát huy sức mạnh đại đoàn kết toàn dân; Mở rộng hợp tác quốc tế; Tăng cường vai trò lãnh đạo của Đảng là nhiệm vụ then chốt. ",
      "Đại hội đề ra 6 quan điểm về CNH, HĐH trong thời kỳ mới, nhấn mạnh: Dựa vào nguồn lực trong nước là chính; CNH, HĐH là sự nghiệp của toàn dân; Lấy phát huy nguồn lực con người làm yếu tố cơ bản; Khoa học và công nghệ là động lực. ",
      "Hội nghị Trung ương 5 (7-1998) ban hành Nghị quyết 'Xây dựng và phát triển nền văn hoá Việt Nam tiên tiến, đậm đà bản sắc dân tộc', khẳng định văn hóa là nền tảng tinh thần, vừa là mục tiêu vừa là động lực."
    ],
    "significance": [
      "Đại hội VIII là một dấu mốc quan trọng, đánh dấu bước ngoặt đưa đất nước sang thời kỳ mới đẩy mạnh CNH, HĐH.",
      "Đại hội chính thức khẳng định nước ta đã ra khỏi khủng hoảng kinh tế-xã hội, đường lối đổi mới là đúng đắn, con đường đi lên CNXH ngày càng được xác định rõ hơn."
    ],
    "media": {
      "images": [
        {
          "src": "/images/dai-hoi-8-1.jpg",
          "caption": "Hình ảnh Đại hội VIII của Đảng"
        }
      ],
      "videoUrl": "/video/daihoi8.mp4"
    }
  },
  "IX": {
    "id": "IX",
    "title": "Đại hội đại biểu toàn quốc lần thứ IX",
    "time": "19 - 22/04/2001",
    "location": "Hà Nội",
    "heroImage": "/images/dai-hoi-9-1.jpg",
    "context": [
      "Đại hội IX họp tại Hà Nội từ ngày 19 đến 22/4/2001, với 1.168 đại biểu đại diện cho hơn 2,2 triệu đảng viên trong cả nước.",
      "Đại hội mở đầu thế kỷ XXI, trong bối cảnh cách mạng khoa học và công nghệ, kinh tế tri thức, toàn cầu hóa diễn ra mạnh mẽ.",
      "Sau sự kiện 11/9/2001, tình hình thế giới diễn biến phức tạp, các nước lớn tăng cường can thiệp vào công việc nội bộ nhiều quốc gia.",
      "Khu vực châu Á - Thái Bình Dương là khu vực phát triển năng động nhưng tiềm ẩn nhiều nhân tố gây mất ổn định.",
      "Trong nước, sau 15 năm đổi mới, đất nước đạt nhiều thành tựu: GDP từ 15,5 tỷ USD (1991) lên hơn 35 tỷ USD (2000), đời sống nhân dân cải thiện, vị thế quốc tế nâng cao.",
      "Tuy nhiên, kinh tế phát triển chưa vững chắc, hiệu quả và sức cạnh tranh còn thấp. Bốn nguy cơ (tụt hậu, chệch hướng, tham nhũng - quan liêu, 'diễn biến hòa bình') vẫn là thách thức lớn."
    ],
    "contentHighlights": [
      {
        "title": "Tư tưởng Hồ Chí Minh",
        "description": "Lần đầu tiên Đảng xác định rõ nội dung cơ bản của Tư tưởng Hồ Chí Minh là kết quả vận dụng sáng tạo chủ nghĩa Mác - Lênin vào điều kiện Việt Nam, kế thừa giá trị dân tộc và tinh hoa nhân loại. Được khẳng định là tài sản tinh thần vô giá, mãi mãi soi đường cho cách mạng Việt Nam."
      },
      {
        "title": "Mô hình Kinh tế Tổng quát",
        "description": "Khẳng định nền kinh tế thị trường định hướng xã hội chủ nghĩa là mô hình kinh tế tổng quát trong thời kỳ quá độ. Nền kinh tế nhiều thành phần, vận động theo cơ chế thị trường có sự quản lý của Nhà nước, phân phối theo lao động, hiệu quả và phúc lợi xã hội."
      },
      {
        "title": "Chiến lược Phát triển 2001-2010",
        "description": "Đại hội thông qua Chiến lược phát triển kinh tế - xã hội 10 năm (2001-2010), mục tiêu đưa Việt Nam ra khỏi tình trạng kém phát triển, tạo nền tảng để đến 2020 cơ bản trở thành nước công nghiệp hiện đại."
      },
      {
        "title": "Đường lối Đối ngoại và Hội nhập",
        "description": "Thực hiện đường lối đối ngoại độc lập, tự chủ, đa phương hoá, đa dạng hoá; chủ động hội nhập quốc tế. Việt Nam sẵn sàng là bạn, là đối tác tin cậy của cộng đồng quốc tế, phấn đấu vì hòa bình, độc lập và phát triển."
      },
      {
        "title": "Xây dựng Đảng và Hệ thống Chính trị",
        "description": "Tăng cường sự thống nhất trong Đảng về nhận thức, ý chí và hành động; kiên định chủ nghĩa Mác - Lênin, tư tưởng Hồ Chí Minh, độc lập dân tộc gắn liền với CNXH; kiên quyết đấu tranh chống bốn nguy cơ, không chấp nhận đa nguyên, đa đảng."
      },
      {
        "title": "Văn hóa và Công tác Tư tưởng",
        "description": "Xác định văn hóa là nền tảng tinh thần của xã hội, vừa là mục tiêu vừa là động lực phát triển. Xây dựng nền văn hóa tiên tiến, đậm đà bản sắc dân tộc; xây dựng con người Việt Nam phát triển toàn diện; giữ vững vai trò chủ đạo của chủ nghĩa Mác - Lênin và tư tưởng Hồ Chí Minh trong đời sống tinh thần."
      }
    ],
    "fullContentSummary": [
      "## Thông tin chung\n\n**Đại hội IX của Đảng Cộng sản Việt Nam** họp tại **Hà Nội** từ **19–22/4/2001**, với sự tham dự của **1.168 đại biểu**, đại diện cho hơn **2,2 triệu đảng viên** trong cả nước.\n\nBan Chấp hành Trung ương gồm **150 ủy viên**, **Bộ Chính trị** có **15 đồng chí**; **đồng chí Nông Đức Mạnh** được bầu làm **Tổng Bí thư** của Đảng.",

      "## Văn kiện và đường lối\n\nĐại hội IX đã thông qua **Chiến lược phát triển kinh tế - xã hội 2001–2010** và xác định rõ **nội dung cơ bản của Tư tưởng Hồ Chí Minh**, coi đây là **nền tảng tư tưởng** và **kim chỉ nam cho hành động** của toàn Đảng, toàn dân.",

      "## Bối cảnh lịch sử\n\n**Quốc tế:** Đầu thế kỷ XXI, **cách mạng khoa học – công nghệ**, **kinh tế tri thức**, và **toàn cầu hóa** phát triển mạnh mẽ. Sau sự kiện **11/9/2001**, tình hình thế giới biến động phức tạp.\n\n**Trong nước:** Sau **15 năm đổi mới**, Việt Nam đạt nhiều thành tựu quan trọng nhưng vẫn đối diện **bốn nguy cơ lớn**:\n\n1. Tụt hậu xa về kinh tế\n2. Chệch hướng xã hội chủ nghĩa\n3. Tệ nạn tham nhũng – quan liêu\n4. Âm mưu “diễn biến hòa bình”",

      "## Thành tựu 15 năm đổi mới\n\n- Kinh tế tăng trưởng liên tục\n- Đời sống nhân dân được cải thiện\n- Vị thế quốc tế được nâng cao\n\n> GDP tăng từ **15,5 tỷ USD (1991)** lên hơn **35 tỷ USD (2000)**.",

      "## Về lý luận và tư tưởng\n\nLần đầu tiên, **Đại hội IX** xác định rõ nội dung của **Tư tưởng Hồ Chí Minh** là:\n\n> Kết quả của sự vận dụng sáng tạo **chủ nghĩa Mác - Lênin** vào điều kiện Việt Nam, kế thừa **giá trị truyền thống dân tộc** và **tinh hoa văn hóa nhân loại**, là **tài sản tinh thần to lớn** của Đảng và dân tộc.",

      "## Phát triển kinh tế - xã hội\n\nĐại hội IX khẳng định mô hình **kinh tế thị trường định hướng xã hội chủ nghĩa** là **mô hình tổng quát trong thời kỳ quá độ lên CNXH**.\n\nNền kinh tế có đặc trưng:\n\n- Nhiều **hình thức sở hữu**, **thành phần kinh tế**, **hình thức phân phối**\n- Phân phối **chủ yếu theo kết quả lao động và hiệu quả kinh tế**, đồng thời thông qua **phúc lợi xã hội**\n\n> **Động lực phát triển:** Đại đoàn kết toàn dân, trên cơ sở **liên minh công – nông – trí thức**, kết hợp hài hòa **lợi ích cá nhân – tập thể – xã hội**.",

      "## Mục tiêu chiến lược 2001–2010\n\n- Đưa Việt Nam **ra khỏi tình trạng kém phát triển**\n- **GDP năm 2010 gấp đôi năm 2000**\n- **Tạo nền tảng để đến 2020** cơ bản trở thành **nước công nghiệp theo hướng hiện đại**",

      "## Đường lối đối ngoại\n\n- Thực hiện chính sách **độc lập, tự chủ, rộng mở, đa phương hóa, đa dạng hóa**\n- **Chủ động hội nhập kinh tế quốc tế**\n- Việt Nam sẵn sàng là **bạn, đối tác tin cậy** của các nước, **phấn đấu vì hòa bình, độc lập, phát triển**",

      "## Xây dựng Đảng\n\n- Kiên định **chủ nghĩa Mác - Lênin**, **Tư tưởng Hồ Chí Minh**\n- Giữ vững **độc lập dân tộc gắn liền CNXH**\n- **Không chấp nhận đa nguyên, đa đảng**\n- Tiếp tục thực hiện các **bài học đổi mới** từ Đại hội VI, VII, VIII",

      "## Văn hóa và công tác tư tưởng\n\n**Văn hóa** được xác định là **nền tảng tinh thần của xã hội**, vừa là **mục tiêu**, vừa là **động lực phát triển**.\n\nHướng đến con người Việt Nam **toàn diện về chính trị, tư tưởng, đạo đức, trí tuệ, thể chất và thẩm mỹ**.\n\n> **Nền văn hóa Việt Nam**: *Tiên tiến, đậm đà bản sắc dân tộc* — gắn lý tưởng độc lập dân tộc và CNXH với **lòng yêu nước, đoàn kết, nhân ái, cần cù, sáng tạo**.",

      "## Các nghị quyết Trung ương tiêu biểu khóa IX\n\n- **TW3 (9/2001):** Đổi mới, sắp xếp và nâng cao hiệu quả **doanh nghiệp nhà nước**.\n- **TW5 (3/2002):** Phát triển **kinh tế tập thể và kinh tế tư nhân**; coi kinh tế tư nhân là **bộ phận cấu thành quan trọng** của nền kinh tế quốc dân.\n- **TW7 (3/2003):** Ba nghị quyết về **đại đoàn kết dân tộc**, **công tác dân tộc**, **công tác tôn giáo**.\n- **TW8 (7/2003):** Ban hành **Chiến lược bảo vệ Tổ quốc trong tình hình mới**.\n- **Nghị quyết 36 (3/2004):** Về **người Việt Nam ở nước ngoài** – xác định **kiều bào là bộ phận không tách rời** của dân tộc.",

      "## Ý nghĩa công nghiệp hóa – hiện đại hóa\n\n- Đánh dấu **bước ngoặt** trong sự nghiệp CNH – HĐH\n- Xác định **mục tiêu chiến lược**: Đưa Việt Nam **cơ bản trở thành nước công nghiệp hiện đại vào năm 2020**\n- Đề cao **đại đoàn kết toàn dân** như **động lực chủ yếu cho CNH, HĐH**",

      "## Ý nghĩa lịch sử – chính trị\n\n- Đại hội IX là **đại hội mở đầu thế kỷ XXI**\n- Đánh dấu **bước trưởng thành về tư duy lý luận và thực tiễn đổi mới**\n- Cụ thể hóa **Cương lĩnh 1991**, khẳng định **con đường đi lên CNXH ở Việt Nam là đúng đắn**\n- Đặt nền móng cho **giai đoạn đẩy mạnh CNH, HĐH và hội nhập quốc tế**",

      "## Hội nhập quốc tế\n\n**Hội nghị Bộ trưởng APEC lần thứ 18** được tổ chức tại **Hà Nội (11/2006)**, thể hiện **vị thế ngày càng cao của Việt Nam** trong khu vực và trên trường quốc tế."
    ],
    "significance": [
      "Đại hội IX đánh dấu bước ngoặt trong sự nghiệp công nghiệp hóa, hiện đại hóa đất nước; xác định mục tiêu lâu dài đến 2020 và định hình mô hình kinh tế tổng quát.",
      "Khẳng định bước trưởng thành về tư duy lý luận và thực tiễn đổi mới của Đảng, cụ thể hóa Cương lĩnh 1991.",
      "Là Đại hội mở đầu thế kỷ XXI, đặt nền móng cho thời kỳ hội nhập quốc tế và phát triển bền vững của Việt Nam."
    ],
    "media": {
      "images": [
        {
          "src": "/images/dai-hoi-9-1.jpg",
          "caption": "Hình chụp toàn cảnh Hội trường Đại hội IX của Đảng, Hà Nội, 4/2001"
        },
        {
          "src": "/images/dai-hoi-9-2.jpg",
          "caption": "Đồng chí Nông Đức Mạnh tại Đại hội IX, 2001"
        },
        {
          "src": "/images/dai-hoi-9-3.jpg",
          "caption": "Hội nghị Bộ trưởng APEC lần thứ 18 tại Hà Nội, tháng 11/2006"
        }
      ],
      "videoUrl": "/video/daihoi9.mp4"
    }
  },
  "X": {
    "id": "X",
    "title": "Đại hội đại biểu toàn quốc lần thứ X",
    "time": "18 - 25/04/2006",
    "location": "Hà Nội",
    "heroImage": "/images/dai-hoi-10-1.jpg",
    "context": [
      "Đất nước đã trải qua 20 năm đổi mới, đạt nhiều thành tựu to lớn có ý nghĩa lịch sử. Thế và lực, uy tín quốc tế của Việt Nam tăng lên rõ rệt.",
      "Tình hình thế giới diễn biến phức tạp, toàn cầu hóa và hội nhập quốc tế vừa là cơ hội, vừa là thách thức."
    ],
    "contentHighlights": [
      {
        "title": "Tổng kết 20 năm Đổi mới",
        "description": "Đại hội tổng kết lý luận và thực tiễn 20 năm đổi mới, rút ra 5 bài học kinh nghiệm về kiên định mục tiêu độc lập dân tộc gắn liền với CNXH, đổi mới toàn diện và đồng bộ, phát huy vai trò của nhân dân, kết hợp nội lực với ngoại lực và nâng cao năng lực lãnh đạo của Đảng."
      },
      {
        "title": "Nhận thức mới về Xã hội Xã hội chủ nghĩa",
        "description": "Đại hội bổ sung và diễn đạt lại các đặc trưng của xã hội XHCN mà nhân dân ta xây dựng, gồm 8 đặc trưng cơ bản như dân giàu, nước mạnh, công bằng, dân chủ, văn minh; do nhân dân làm chủ; có Nhà nước pháp quyền XHCN của nhân dân, do nhân dân, vì nhân dân."
      },
      {
        "title": "Xây dựng, chỉnh đốn Đảng – Nhiệm vụ then chốt",
        "description": "Lần đầu tiên Đại hội đặt nhiệm vụ xây dựng, chỉnh đốn Đảng ở vị trí hàng đầu trong chủ đề Đại hội. Làm rõ bản chất Đảng Cộng sản Việt Nam là đội tiên phong của giai cấp công nhân, nhân dân lao động và của dân tộc Việt Nam."
      },
      {
        "title": "Đảng viên làm kinh tế tư nhân",
        "description": "Đại hội X cho phép đảng viên làm kinh tế tư nhân, kể cả tư bản tư nhân, nhưng phải tuân thủ Điều lệ Đảng, nghị quyết của Đảng và quy định của pháp luật Nhà nước."
      },
      {
        "title": "Phát huy sức mạnh toàn dân tộc",
        "description": "Xóa bỏ mặc cảm, định kiến, tôn trọng những ý kiến khác nhau không trái lợi ích dân tộc; xây dựng đồng thuận xã hội, đề cao truyền thống nhân nghĩa, khoan dung, tinh thần cởi mở và tin cậy lẫn nhau."
      },
      {
        "title": "Đẩy mạnh CNH, HĐH gắn với kinh tế tri thức",
        "description": "Đại hội xác định CNH, HĐH là nhiệm vụ trung tâm, gắn với phát triển kinh tế tri thức và hội nhập quốc tế, hoàn thiện thể chế kinh tế thị trường định hướng XHCN."
      },
      {
        "title": "Văn hóa và Công tác Tư tưởng",
        "description": "Xác định văn hóa là nền tảng tinh thần của xã hội, vừa là mục tiêu vừa là động lực phát triển. Làm cho chủ nghĩa Mác - Lênin và tư tưởng Hồ Chí Minh giữ vai trò chủ đạo trong đời sống tinh thần, đẩy mạnh đấu tranh làm thất bại âm mưu 'diễn biến hòa bình'."
      }
    ],
    "fullContentSummary": [
      "## Thông tin chung\n\n**Đại hội X của Đảng Cộng sản Việt Nam** họp tại **Hà Nội** từ **18–25/4/2006**, với sự tham dự của **1.176 đại biểu**, đại diện cho hơn **3,1 triệu đảng viên**.\n\nBan Chấp hành Trung ương gồm **160 ủy viên chính thức**, **21 ủy viên dự khuyết**; **Bộ Chính trị** có **14 đồng chí**; **đồng chí Nông Đức Mạnh** được bầu lại làm **Tổng Bí thư**.",

      "## Chủ đề Đại hội\n\n> 'Nâng cao năng lực lãnh đạo và sức chiến đấu của Đảng, phát huy sức mạnh toàn dân tộc, đẩy mạnh toàn diện công cuộc đổi mới, sớm đưa nước ta ra khỏi tình trạng kém phát triển.'",

      "## Bối cảnh lịch sử\n\n**Trong nước:**\n- Đất nước đã trải qua **20 năm đổi mới**, đạt nhiều thành tựu to lớn.\n- Thế và lực, uy tín quốc tế của Việt Nam tăng lên rõ rệt.\n\n**Quốc tế:**\n- Tình hình thế giới diễn biến nhanh, phức tạp, khó lường.\n- Toàn cầu hóa và hội nhập quốc tế vừa là cơ hội, vừa là thách thức.\n- Tiếp tục đổi mới toàn diện để xây dựng và bảo vệ Tổ quốc trong điều kiện mới.",

      "## Tổng kết 20 năm đổi mới và Bài học kinh nghiệm\n\n- Kiên định mục tiêu **độc lập dân tộc** và **chủ nghĩa xã hội** trên nền tảng **chủ nghĩa Mác-Lênin** và **Tư tưởng Hồ Chí Minh**.\n- Đổi mới **toàn diện, đồng bộ**, có kế thừa và cách làm phù hợp.\n- Đổi mới vì **lợi ích của nhân dân**, dựa vào nhân dân, phát huy vai trò chủ động, sáng tạo.\n- Phát huy **nội lực** và tranh thủ **ngoại lực**, kết hợp sức mạnh dân tộc với sức mạnh thời đại.\n- Nâng cao **năng lực lãnh đạo và sức chiến đấu của Đảng**, đổi mới hệ thống chính trị và xây dựng nền dân chủ xã hội chủ nghĩa.",

      "## Nhận thức mới về Xã hội XHCN\n\nĐại hội X đã bổ sung hai đặc trưng mới của xã hội XHCN và làm rõ các đặc trưng khác:\n- **Dân giàu, nước mạnh, công bằng, dân chủ, văn minh**.\n- **Do nhân dân làm chủ**.\n- **Nền kinh tế phát triển cao**, dựa trên lực lượng sản xuất hiện đại.\n- **Văn hóa tiên tiến**, đậm đà bản sắc dân tộc.\n- **Con người phát triển toàn diện**, được giải phóng khỏi áp bức và bất công.\n- **Đoàn kết dân tộc**, bình đẳng giữa các dân tộc.\n- **Nhà nước pháp quyền XHCN của nhân dân, do nhân dân, vì nhân dân**.\n- **Quan hệ hữu nghị, hợp tác quốc tế**.",

      "## Nhiệm vụ trọng tâm và các chủ trương nổi bật\n\n**Xây dựng Đảng (nhiệm vụ then chốt):**\n- Nâng cao năng lực hoạch định đường lối, chính sách; tổ chức chỉ đạo thực hiện, tổng kết lý luận thực tiễn.\n- Làm sáng tỏ bản chất của Đảng: *'Đảng Cộng sản Việt Nam là đội tiên phong của giai cấp công nhân, đồng thời là đội tiên phong của nhân dân lao động và của dân tộc Việt Nam.'*\n- Cho phép đảng viên làm **kinh tế tư nhân** nhưng phải tuân thủ Điều lệ Đảng và pháp luật.\n\n**Phát huy sức mạnh toàn dân tộc:**\n- Mục tiêu: *'giữ vững độc lập, thống nhất của Tổ quốc, vì dân giàu, nước mạnh, xã hội công bằng, dân chủ, văn minh.'*\n- Đoàn kết rộng rãi, tôn trọng ý kiến khác nhau nhưng không trái lợi ích dân tộc.\n- Xây dựng đồng thuận xã hội dựa trên truyền thống nhân nghĩa, khoan dung.\n\n**Đẩy mạnh toàn diện công cuộc đổi mới:**\n- Hoàn thiện thể chế kinh tế thị trường định hướng XHCN.\n- Đẩy mạnh **công nghiệp hóa, hiện đại hóa** gắn với **kinh tế tri thức**.\n- Mở rộng quan hệ đối ngoại, tích cực hội nhập quốc tế, Việt Nam là bạn, đối tác tin cậy của các nước.",

      "## Văn hóa và công tác tư tưởng\n\n- **Văn hóa** là nền tảng tinh thần của xã hội, vừa là mục tiêu, vừa là động lực.\n- Xây dựng nền văn hóa Việt Nam **tiên tiến, đậm đà bản sắc dân tộc**, gắn phát triển kinh tế với văn hóa và con người.\n- Xây dựng con người Việt Nam mới: yêu nước, nhân ái, sống có trách nhiệm, sáng tạo, ý thức cộng đồng.\n- Đảm bảo **chủ nghĩa Mác – Lênin** và **Tư tưởng Hồ Chí Minh** giữ vai trò chủ đạo trong đời sống tinh thần.\n- Đẩy mạnh tuyên truyền, giáo dục tư tưởng Hồ Chí Minh; đấu tranh làm thất bại âm mưu “diễn biến hòa bình”.",

      "## Một số Nghị quyết Trung ương tiêu biểu khóa IX\n\n- **TW3 (9–2001):** Sắp xếp, đổi mới, phát triển và nâng cao hiệu quả doanh nghiệp nhà nước.\n- **TW5 (3–2002):** Phát triển kinh tế tập thể và kinh tế tư nhân, khẳng định vai trò kinh tế tư nhân trong nền kinh tế quốc dân.\n- **TW7 (3–2003):** Ba nghị quyết về đại đoàn kết dân tộc, công tác dân tộc, công tác tôn giáo.\n- **TW8 (7–2003):** Thông qua Chiến lược bảo vệ Tổ quốc trong tình hình mới.\n- **Nghị quyết 36 (2004):** Về người Việt Nam ở nước ngoài, khẳng định kiều bào là bộ phận không tách rời của dân tộc Việt Nam.",

      "## Ý nghĩa CNH – HĐH\n\n- Đại hội X đánh dấu **bước ngoặt quan trọng** trong CNH – HĐH.\n- Xác định CNH – HĐH là **nhiệm vụ trung tâm của thời kỳ quá độ lên CNXH**, gắn với phát triển bền vững và kinh tế tri thức.\n- CNH – HĐH là **động lực then chốt**, kết hợp nội lực và ngoại lực, để đạt mục tiêu 'Dân giàu, nước mạnh, công bằng, dân chủ, văn minh'.\n- Đặt nền tảng cho **chiến lược phát triển giai đoạn 2011–2020**.",

      "## Ý nghĩa lịch sử – chính trị\n\n- Đại hội X là dấu mốc quan trọng trong tiến trình đổi mới toàn diện đất nước.\n- Khẳng định sự trưởng thành về bản lĩnh chính trị, tư duy lý luận và năng lực lãnh đạo của Đảng.\n- Cụ thể hóa **Cương lĩnh 1991** và **Chiến lược phát triển kinh tế – xã hội 2001–2010**.\n- Khẳng định đường lối đổi mới là đúng đắn, sáng tạo và phù hợp thực tiễn Việt Nam.\n- Đặt nền tảng cho giai đoạn phát triển mới, hướng tới mục tiêu **dân giàu, nước mạnh, xã hội công bằng, dân chủ, văn minh**.",

      "## Hội nhập quốc tế\n\n- Trong nhiệm kỳ, Việt Nam chính thức trở thành thành viên thứ **150 của Tổ chức Thương mại Thế giới (WTO) năm 2007**.\n- Tiếp tục mở rộng quan hệ đối ngoại, chủ động hội nhập kinh tế quốc tế."
    ],
    "significance": [
      "Đại hội X là dấu mốc quan trọng trong tiến trình đổi mới toàn diện đất nước, khẳng định sự trưởng thành về bản lĩnh chính trị, tư duy lý luận và năng lực lãnh đạo của Đảng.",
      "Là bước phát triển mới trong việc cụ thể hóa Cương lĩnh 1991 và Chiến lược phát triển kinh tế - xã hội 2001-2010, làm sáng tỏ hơn con đường đi lên CNXH ở Việt Nam.",
      "Khẳng định đường lối đổi mới là đúng đắn, sáng tạo, tiếp tục hoàn thiện nhận thức về CNH, HĐH gắn với phát triển kinh tế tri thức và hội nhập quốc tế.",
      "Tạo nền tảng cho chiến lược phát triển giai đoạn 2011-2020, hướng tới mục tiêu dân giàu, nước mạnh, xã hội công bằng, dân chủ, văn minh."
    ],
    "media": {
      "images": [
        {
          "src": "/images/dai-hoi-10-1.jpg",
          "caption": "Đại hội đại biểu toàn quốc lần thứ X, năm 2006"
        },
        {
          "src": "/images/dai-hoi-10-2.jpg",
          "caption": "Tổng bí thư Nông Đức Mạnh tái đắc cử"
        },
        {
          "src": "/images/dai-hoi-10-3.jpg",
          "caption": "Việt Nam chính thức là thành viên thứ 150 của WTO"
        },
        {
          "src": "/images/dai-hoi-10-4.jpg",
          "caption": "Nhà máy lọc dầu Dung Quất – công trình trọng điểm quốc gia thời kỳ 2006-2011"
        }
      ],
      "videoUrl": "/video/daihoi10.mp4"
    }
  },
  "XI": {
    "id": "XI",
    "title": "Đại hội đại biểu toàn quốc lần thứ XI",
    "time": "12 - 19/01/2011",
    "location": "Hà Nội",
    "heroImage": "/images/dai-hoi-11-1.jpg",
    "context": [
      "Đại hội XI diễn ra trong bối cảnh đất nước đang bước vào giai đoạn công nghiệp hóa – hiện đại hóa. Nền kinh tế – xã hội đã đạt nhiều kết quả tích cực, nhưng vẫn còn những hạn chế như năng suất lao động chưa cao, cơ chế quản lý chưa đồng bộ, cùng tình trạng tham nhũng, quan liêu.",
      "Trên thế giới, cuộc cách mạng khoa học – công nghệ, toàn cầu hóa và kinh tế tri thức phát triển mạnh mẽ. Đồng thời, các mâu thuẫn về chính trị, kinh tế, an ninh vẫn diễn ra phức tạp, đặc biệt ở khu vực châu Á – Thái Bình Dương, đặt ra yêu cầu cho Việt Nam phải tăng cường hội nhập quốc tế và ứng phó với thách thức mới.",
      "Trong bối cảnh đó, Đại hội XI đề ra định hướng phát triển đất nước đến năm 2020, theo Cương lĩnh 2011, nhấn mạnh phát triển nền kinh tế thị trường định hướng xã hội chủ nghĩa với nhiều thành phần kinh tế cùng tồn tại, phát triển kinh tế gắn với nâng cao đời sống nhân dân, củng cố quốc phòng – an ninh, xây dựng Đảng trong sạch, vững mạnh. Đồng thời, Đại hội xác định đổi mới mô hình tăng trưởng, nâng cao năng lực cạnh tranh, bảo đảm tiến trình công nghiệp hóa – hiện đại hóa và hội nhập sâu rộng với thế giới, góp phần xây dựng xã hội dân giàu, nước mạnh, dân chủ, công bằng, văn minh."
    ],
    "contentHighlights": [
      {
        "title": "Cương lĩnh(bổ sung, 2011)",
        "description": "Thông qua \"Cương lĩnh xây dựng đất nước trong thời kỳ quá độ lên chủ nghĩa xã hội (bổ sung, phát triển năm 2011)\", khẳng định định hướng xây dựng xã hội dân giàu, nước mạnh, dân chủ, công bằng, văn minh, củng cố vai trò lãnh đạo của Đảng và bổ sung các nhận thức, phương hướng phát triển đất nước trong bối cảnh mới."
      },
      {
        "title": "Chiến lược 2011-2020",
        "description": "Thông qua \"Chiến lược phát triển kinh tế-xã hội 2011-2020\", xác định quan điểm phát triển nhanh, bền vững, đề ra ba đột phá chiến lược và định hướng đổi mới mô hình tăng trưởng, cơ cấu lại nền kinh tế, hoàn thiện bộ máy Nhà nước, cải cách hành chính, phòng chống tham nhũng, phát huy quyền làm chủ của nhân dân, với mục tiêu xây dựng Việt Nam “dân giàu, nước mạnh, dân chủ, công bằng, văn minh”."
      },
      {
        "title": "Các Hội nghị Trung ương và Nghị quyết",
        "description": "Các Hội nghị Trung ương tập trung đột phá về kinh tế, xây dựng Đảng, giáo dục, văn hóa và quốc phòng, cụ thể hóa các mục tiêu của Cương lĩnh 2011, đồng thời tự đổi mới, tự chỉnh đốn Đảng, nâng cao hiệu quả quản lý Nhà nước, thúc đẩy phát triển bền vững đất nước và xây dựng Việt Nam trở thành quốc gia công nghiệp hiện đại."
      }
    ],
    "fullContentSummary": [
      "# Điểm mới nổi bật của Đại hội XI",
      "Đại hội XI thông qua **hai văn kiện quan trọng**:",
      "- *Cương lĩnh xây dựng đất nước trong thời kỳ quá độ lên chủ nghĩa xã hội (bổ sung, phát triển năm 2011)*",
      "- *Chiến lược phát triển kinh tế-xã hội 2011-2020*",
      "## Cương lĩnh xây dựng đất nước trong thời kỳ quá độ lên chủ nghĩa xã hội (bổ sung, phát triển năm 2011)",
      "Cương lĩnh có kết cấu **4 phần** cơ bản giữ như Cương lĩnh năm 1991 có bổ sung, phát triển nhận thức mới ở tiêu đề và nội dung từng phần:",
      "1. Quá trình cách mạng và những bài học kinh nghiệm",
      "Cương lĩnh khẳng định những bài học kinh nghiệm lớn:",
      "- Một là, nắm vững ngọn cờ độc lập dân tộc và chủ nghĩa xã hội.",
      "- Hai là, sự nghiệp cách mạng là của nhân dân, do nhân dân và vì nhân dân. - (Bổ sung vào nội dung: “Quan liêu, tham nhũng, xa rời nhân dân, sẽ dẫn đến những tổn thất khôn lường đối với vận mệnh của đất nước, của chế độ xã hội chủ nghĩa và của Đảng”.",
      "- Ba là, không ngừng củng cố, tăng cường đoàn kết, đoàn kết toàn Đảng, đoàn kết toàn dân, đoàn kết dân tộc, đoàn kết quốc tế.",
      "- Bốn là, kết hợp sức mạnh dân tộc với sức mạnh thời đại, sức mạnh trong nước với sức mạnh quốc tế.",
      "- Năm là, sự lãnh đạo đúng đắn của Đảng là nhân tố hàng đầu **quyết định** thắng lợi của cách mạng Việt Nam. (sửa đổi từ \"đảm bảo\" thành \"quyết định\") ",
      "2. Quá độ lên chủ nghĩa xã hội ở nước ta",
      "- Cuộc cách mạng khoa học – công nghệ, kinh tế tri thức và toàn cầu hóa diễn ra mạnh mẽ.",
      "- Hòa bình, độc lập dân tộc, dân chủ, hợp tác và phát triển là xu thế lớn, nhưng các mâu thuẫn cơ bản trên thế giới vẫn phức tạp.",
      "- Đặc điểm nổi bật của thời đại là các quốc gia với chế độ và trình độ phát triển khác nhau vừa hợp tác vừa đấu tranh vì lợi ích dân tộc. Dù gặp nhiều khó khăn, cuộc đấu tranh của nhân dân vì hòa bình, độc lập, dân chủ và tiến bộ xã hội vẫn tiếp tục phát triển; “Theo quy luật tiến hoá của lịch sử, loài người nhất định sẽ tiến tới chủ nghĩa xã hội”",
      "3. Những định hướng lớn về chính sách kinh tế, xã hội, quốc phòng - an ninh, đối ngoại",
      "Cương lĩnh 2011 xác định xã hội chủ nghĩa Việt Nam là: “dân giàu, nước mạnh, dân chủ, công bằng, văn minh”, do nhân dân làm chủ, có nền kinh tế phát triển cao, văn hóa tiên tiến, đậm đà bản sắc dân tộc, con người ấm no, tự do, hạnh phúc, các dân tộc bình đẳng, đoàn kết, và Nhà nước pháp quyền xã hội chủ nghĩa do Đảng Cộng sản lãnh đạo.",
      "Bổ sung hai đặc trưng bao trùm: “Dân giàu, nước mạnh, dân chủ, công bằng, văn minh” và “Nhà nước pháp quyền xã hội chủ nghĩa của nhân dân, do nhân dân, vì nhân dân”, đồng thời diễn đạt các đặc trưng khác rõ ràng, toàn diện hơn.",
      "Xây dựng chủ nghĩa xã hội là quá trình cách mạng sâu sắc, lâu dài, với sự đấu tranh giữa cái cũ và cái mới trên mọi lĩnh vực.",
      "Mục tiêu đến giữa thế kỷ XXI: xây dựng Việt Nam trở thành nước công nghiệp hiện đại theo định hướng xã hội chủ nghĩa, có nền tảng kinh tế, chính trị, tư tưởng, văn hóa phù hợp.",
      "**8 phương hướng cơ bản** xây dựng chủ nghĩa xã hội ở nước ta:",
      "- Một là, đẩy mạnh công nghiệp hoá, hiện đại hoá đất nước gắn với phát triển kinh tế tri thức, bảo vệ tài nguyên, môi trường.",
      "- Hai là, phát triển nền kinh tế thị trường định hướng xã hội chủ nghĩa.",
      "- Ba là, xây dựng nền văn hoá tiên tiến, đậm đà bản sắc dân tộc; xây dựng con người, nâng cao đời sống nhân dân, thực hiện tiến bộ và công bằng xã hội.",
      "- Bốn là, bảo đảm vững chắc quốc phòng và an ninh quốc gia, trật tự, an toàn xã hội.",
      "- Năm là, thực hiện đường lối đối ngoại độc lập, tự chủ, hoà bình, hữu nghị, hợp tác và phát triển; chủ động và tích cực hội nhập quốc tế.",
      "- Sáu là, xây dựng nền dân chủ xã hội chủ nghĩa, thực hiện đại đoàn kết toàn dân tộc, tăng cường và mở rộng mặt trận dân tộc thống nhất.",
      "- Bảy là, xây dựng Nhà nước pháp quyền xã hội chủ nghĩa của nhân dân, do nhân dân, vì nhân dân.",
      "- Tám là, xây dựng Đảng trong sạch, vững mạnh.",
      "Nắm vững và giải quyết tốt **8 mối quan hệ lớn**:",
      "- Quan hệ giữa đổi mới, ổn định và phát triển.",
      "- Quan hệ giữa đổi mới kinh tế và đổi mới chính trị.",
      "- Quan hệ giữa kinh tế thị trường và định hướng xã hội chủ nghĩa.",
      "- Quan hệ giữa phát triển lực lượng sản xuất và xây dựng, hoàn thiện từng bước quan hệ sản xuất xã hội chủ nghĩa.",
      "- Quan hệ giữa tăng trưởng kinh tế và phát triển văn hoá, thực hiện tiến bộ và công bằng xã hội.",
      "- Quan hệ giữa xây dựng chủ nghĩa xã hội và bảo vệ Tổ quốc xã hội chủ nghĩa.",
      "- Quan hệ giữa độc lập, tự chủ và hội nhập quốc tế.",
      "- Quan hệ giữa Đảng lãnh đạo, Nhà nước quản lý, nhân dân làm chủ.",
      "Phát triển nền kinh tế thị trường định hướng xã hội chủ nghĩa với nhiều hình thức sở hữu, nhiều thành phần kinh tế cùng tồn tại và cạnh tranh bình đẳng theo pháp luật.",
      "Kinh tế nhà nước giữ vai trò chủ đạo.",
      "Kinh tế tập thể được củng cố và phát triển.",
      "Kinh tế tư nhân là một trong những động lực của nền kinh tế.",
      "Kinh tế có vốn đầu tư nước ngoài được khuyến khích phát triển.",
      "Giáo dục và đào tạo là **quốc sách hàng đầu**, có sứ mệnh nâng cao dân trí, phát triển nhân lực, bồi dưỡng nhân tài, gắn với khoa học – công nghệ. “Đầu tư cho giáo dục đào tạo là đầu tư phát triển”",
      "4. Hệ thống chính trị và vai trò lãnh đạo của Đảng",
      "Về Đảng Cộng sản Việt Nam, bổ sung cách diễn đạt bản chất của Đảng: Đảng Cộng sản Việt Nam là đội tiên phong của giai cấp công nhân, đồng thời là đội tiên phong của nhân dân lao động và của dân tộc Việt Nam; đại biểu trung thành lợi ích của giai cấp công nhân, nhân dân lao động và của dân tộc.",
      "Đảng lãnh đạo bằng cương lĩnh, chiến lược, các định hướng về chính sách và chủ trương lớn",
      "## Chiến lược phát triển kinh tế-xã hội 2011-2020",
      "Phát triển nhanh gắn liền với phát triển bền vững là yêu cầu xuyên suốt trong Chiến lược. Đổi mới đồng bộ, phù hợp về kinh tế và chính trị vì mục tiêu xây dựng nước Việt Nam “dân giàu, nước mạnh, dân chủ, công bằng, văn minh”",
      "**3 đột phá chiến lược:**",
      "- Hoàn thiện thể chế kinh tế thị trường định hướng XHCN.",
      "- Phát triển nhanh nguồn nhân lực, nhất là chất lượng cao.",
      "- Xây dựng kết cấu hạ tầng đồng bộ, hiện đại.",
      "Định hướng phát triển kinh tế-xã hội:",
      "- Đổi mới mô hình tăng trưởng, cơ cấu lại nền kinh tế; thực hiện tốt chức năng của Nhà nước, giải quyết đúng đắn mối quan hệ giữa Nhà nước với thị trường.",
      "- Hoàn thiện bộ máy nhà nước, chuyển mạnh về cải cách hành chính; đẩy mạnh đấu tranh phòng, chống tham nhũng, lãng phí.",
      "- Tăng cường sự lãnh đạo của Đảng, phát huy quyền làm chủ của nhân dân trong việc xây dựng bộ máy nhà nước.",
      "## Các Hội nghị Trung ương và Nghị quyết:",
      "Hội nghị Trung ương 4 (2012): Xây dựng kết cấu hạ tầng đồng bộ; phòng, chống suy thoái tư tưởng, đạo đức cán bộ; tăng cường lãnh đạo Đảng trong phòng, chống tham nhũng, lãng phí.",
      "Hội nghị Trung ương 5 (2012): Tổng kết chính sách đất đai; khẳng định đất đai là tài nguyên quốc gia quý giá và nguồn lực to lớn.",
      "Hội nghị Trung ương 6 (2012): Đổi mới, nâng cao hiệu quả doanh nghiệp nhà nước; tái lập Ban Kinh tế và Ban Nội chính Trung ương; đánh giá kiểm điểm tự phê bình, phê bình theo Nghị quyết Trung ương 4.",
      "Hội nghị Trung ương 7 (2013): Hoàn thiện Hiến pháp 1992 (dẫn đến Hiến pháp 2013); tăng cường, đổi mới công tác dân vận.",
      "Hội nghị Trung ương 8 (2013): Nghị quyết về đổi mới căn bản, toàn diện giáo dục và đào tạo; Chiến lược bảo vệ Tổ quốc trong tình hình mới.",
      "Hội nghị Trung ương 9 (2014): Xây dựng và phát triển văn hóa, con người Việt Nam; văn hóa là nền tảng tinh thần và động lực phát triển bền vững.",
      "→ Các hội nghị và nghị quyết ban hành thể hiện sự tập trung của Đảng vào việc thực hiện đường lối đổi mới đã được hoạch định tại Đại hội VI, cụ thể hóa các mục tiêu xây dựng chủ nghĩa xã hội trong Cương lĩnh 2011, đồng thời nỗ lực tự đổi mới, tự chỉnh đốn Đảng để khắc phục những hạn chế, khuyết điểm kéo dài.",
      "## Nhìn lại tiến trình công nghiệp hóa – hiện đại hóa qua các cương lĩnh của các kỳ đại hội",
      "Đại hội VII (1991) – Cương lĩnh 1991: Nhấn mạnh công nghiệp hóa – hiện đại hóa bước đầu, với trọng tâm là phát triển sản xuất, củng cố hạ tầng và ổn định chính trị.",
      "Đại hội XI (2011) – Cương lĩnh 2011: Hoàn thiện công nghiệp hóa – hiện đại hóa theo hướng bền vững, chất lượng cao, ứng dụng công nghệ tiên tiến, đồng thời kết hợp phát triển xã hội, nâng cao chất lượng nguồn nhân lực và hội nhập quốc tế.",
      "Nói cách khác, Đại hội XI kế thừa mục tiêu của Đại hội VII nhưng mở rộng, nâng cao và hiện đại hóa hơn, phù hợp với bối cảnh hội nhập quốc tế và yêu cầu phát triển bền vững của đất nước."
    ],
    "significance": [
      "Đại hội XI và các nghị quyết sau Đại hội đánh dấu bước phát triển mới trong quá trình xây dựng chủ nghĩa xã hội ở Việt Nam, vừa tiếp tục đổi mới toàn diện, vừa nâng cao vai trò lãnh đạo của Đảng, tạo nền tảng cho phát triển bền vững, hội nhập quốc tế, giữ vững độc lập, tự chủ và ổn định chính trị xã hội."
    ],
    "media": {
      "images": [
        {
          "src": "/images/dai-hoi-11-1.jpg",
          "caption": "Toàn cảnh Đại hội XI của Đảng"
        }
      ],
      "videoUrl": "/video/daihoi11.mp4"
    }
  },
  "XII": {
    "id": "XII",
    "title": "Đại hội đại biểu toàn quốc lần thứ XII",
    "time": "20 - 28/01/2016",
    "location": "Hà Nội",
    "heroImage": "/images/dai-hoi-12-1.jpg",
    "context": [
      "Sau 30 năm đổi mới (1986–2016), Việt Nam đã đạt được thành tựu to lớn và có ý nghĩa lịch sử, đất nước thoát khỏi khủng hoảng kinh tế – xã hội kéo dài, bước vào thời kỳ phát triển ổn định, hội nhập quốc tế sâu rộng.",
      "Tuy nhiên, tình hình thế giới và khu vực diễn biến nhanh, phức tạp, khó lường: cạnh tranh chiến lược giữa các nước lớn gia tăng; các vấn đề an ninh phi truyền thống (biến đổi khí hậu, an ninh mạng, dịch bệnh, khủng bố) tác động mạnh đến khu vực châu Á – Thái Bình Dương.",
      "Trong nước, đổi mới vẫn còn nhiều hạn chế: tăng trưởng chưa bền vững, năng suất lao động thấp, nợ công cao, chênh lệch giàu nghèo lớn; tình trạng tham nhũng, suy thoái đạo đức, “tự diễn biến, tự chuyển hóa” trong một bộ phận cán bộ, đảng viên gây bức xúc xã hội.",
      "Tình hình thế giới và khu vực diễn biến rất nhanh, phức tạp, khó lường… Trong nước, sau 30 năm đổi mới, đất nước ta đã đạt được những thành tựu to lớn, có ý nghĩa lịch sử; song kinh tế vẫn phát triển chưa bền vững, năng suất lao động và sức cạnh tranh còn thấp; tham nhũng, lãng phí, suy thoái về tư tưởng chính trị, đạo đức, lối sống trong một bộ phận cán bộ, đảng viên chưa được đẩy lùi."
    ],
    "contentHighlights": [
      {
        "title": "Chủ đề Đại hội",
        "description": "“Tăng cường xây dựng Đảng trong sạch, vững mạnh; Phát huy sức mạnh toàn dân tộc và dân chủ xã hội chủ nghĩa; Đẩy mạnh toàn diện, đồng bộ công cuộc đổi mới; Bảo vệ vững chắc Tổ quốc, giữ vững môi trường hòa bình, ổn định; Phấn đấu sớm đưa nước ta cơ bản trở thành nước công nghiệp theo hướng hiện đại.”"
      },
      {
        "title": "6 nhiệm vụ trọng tâm",
        "description": "1. Xây dựng, chỉnh đốn Đảng. \n 2. Xây dựng bộ máy tinh gọn.\n 3. Đổi mới mô hình tăng trưởng.\n 4. Phát triển văn hóa, con người.\n 5. Giữ vững quốc phòng, an ninh.\n 6. Chủ động hội nhập quốc tế."
      },
      {
        "title": "Các nghị quyết tiêu biểu",
        "description": "Nghị quyết 04 (2016) về chỉnh đốn Đảng; NQ 10, 11, 12 (2017) về thể chế kinh tế thị trường và doanh nghiệp nhà nước; NQ 18, 19 (2017) về tinh gọn bộ máy; NQ 26, 27, 28 (2018) về cán bộ, tiền lương, bảo hiểm xã hội; NQ 36 (2018) về kinh tế biển."
      }
    ],
    "fullContentSummary": [
      "Văn kiện và nội dung cơ bản của Đại hội XII\nChủ đề Đại hội\n“Tăng cường xây dựng Đảng trong sạch, vững mạnh;\nPhát huy sức mạnh toàn dân tộc và dân chủ xã hội chủ nghĩa;\nĐẩy mạnh toàn diện, đồng bộ công cuộc đổi mới;\nBảo vệ vững chắc Tổ quốc, giữ vững môi trường hòa bình, ổn định;\nPhấn đấu sớm đưa nước ta cơ bản trở thành nước công nghiệp theo hướng hiện đại.”\nNguồn: Ban Tuyên giáo Trung ương (2018), Giáo trình Lịch sử ĐCSVN, tr.186; ĐCSVN (2016), Văn kiện Đại hội XII, Tập I, tr.67.\nĐây là lần đầu tiên Đảng đặt “xây dựng Đảng trong sạch, vững mạnh” lên hàng đầu, thể hiện nhận thức sâu sắc rằng: đổi mới phải gắn liền với chỉnh đốn Đảng.",
      "Các văn kiện quan trọng được thông qua tại Đại hội XII\n- Báo cáo chính trị của Ban Chấp hành Trung ương khóa XI.\n- Báo cáo đánh giá kết quả phát triển kinh tế – xã hội 2011–2015, phương hướng 2016–2020.\n- Báo cáo tổng kết thực hiện Cương lĩnh xây dựng đất nước trong thời kỳ quá độ lên CNXH (2011).\n- Báo cáo tổng kết thi hành Điều lệ Đảng khóa XI.\nNhững văn kiện này định hướng chiến lược phát triển đất nước đến năm 2020, trong đó nhấn mạnh yêu cầu đổi mới mô hình tăng trưởng, cơ cấu lại nền kinh tế, và phát triển kinh tế tư nhân như một động lực quan trọng của nền kinh tế.\n“Phát triển kinh tế tư nhân trở thành một động lực quan trọng của nền kinh tế thị trường định hướng xã hội chủ nghĩa.”\nNguồn: ĐCSVN (2016), Văn kiện Đại hội XII, Tập I, tr.76.",
      "Sáu nhiệm vụ trọng tâm của nhiệm kỳ XII\nĐại hội XII xác định 6 nhiệm vụ trọng tâm (tr.245–247, Tập I):\n1. Tăng cường xây dựng, chỉnh đốn Đảng.\n“Ngăn chặn, đẩy lùi suy thoái về tư tưởng chính trị, đạo đức, lối sống; chống ‘tự diễn biến’, ‘tự chuyển hóa’; kiên quyết đấu tranh phòng, chống tham nhũng, lãng phí, quan liêu.” (Văn kiện Đại hội XII, Tập I, tr.245.)\n2. Xây dựng bộ máy nhà nước tinh gọn, hiệu lực, hiệu quả.\n“Tiếp tục đổi mới tổ chức bộ máy của hệ thống chính trị theo hướng tinh gọn, hoạt động hiệu lực, hiệu quả; đẩy mạnh cải cách hành chính.” (Văn kiện Đại hội XII, Tập I, tr.246.)\n3. Phát triển kinh tế, đổi mới mô hình tăng trưởng.\n“Đẩy mạnh tái cơ cấu nền kinh tế, đổi mới mô hình tăng trưởng, nâng cao năng suất, hiệu quả và sức cạnh tranh của nền kinh tế.” (Văn kiện Đại hội XII, Tập I, tr.246.)\n4. Phát triển văn hóa, con người Việt Nam.\n“Xây dựng và phát huy giá trị văn hóa, con người Việt Nam trong sự nghiệp xây dựng và bảo vệ Tổ quốc.” (Văn kiện Đại hội XII, Tập I, tr.247.)\n5. Giữ vững quốc phòng, an ninh, trật tự, an toàn xã hội.\n“Kiên quyết, kiên trì bảo vệ độc lập, chủ quyền, thống nhất, toàn vẹn lãnh thổ; chủ động phòng ngừa, làm thất bại mọi âm mưu, hoạt động ‘diễn biến hòa bình’.” (Văn kiện Đại hội XII, Tập I, tr.247.)\n6. Chủ động, tích cực hội nhập quốc tế.\n“Thực hiện đường lối đối ngoại độc lập, tự chủ, hòa bình, hợp tác và phát triển; đa phương hóa, đa dạng hóa quan hệ đối ngoại; chủ động, tích cực hội nhập quốc tế.” (Văn kiện Đại hội XII, Tập I, tr.247.)",
      "Hội nghị Trung ương 4 khóa XII (30/10–9/11/2016)\nNghị quyết 04-NQ/TW: “Tăng cường xây dựng, chỉnh đốn Đảng.”\n“Tăng cường xây dựng, chỉnh đốn Đảng; ngăn chặn, đẩy lùi sự suy thoái về tư tưởng chính trị, đạo đức, lối sống; những biểu hiện ‘tự diễn biến’, ‘tự chuyển hóa’ trong nội bộ; củng cố niềm tin của nhân dân đối với Đảng.”\nTrọng tâm nội dung:\n- Nhận diện 27 biểu hiện suy thoái.\n- Đưa ra 4 nhóm giải pháp: tư tưởng, tổ chức – cán bộ, kiểm tra – giám sát, phát huy vai trò nhân dân.\nÝ nghĩa:\n→ Mở đầu chiến dịch chỉnh đốn Đảng mạnh mẽ thời kỳ 2016–2020; cơ sở hình thành Ban Chỉ đạo Trung ương về phòng, chống tham nhũng.",
      "Hội nghị Trung ương 5 khóa XII (5/2017)\nNghị quyết 10-NQ/TW: “Phát triển kinh tế tư nhân trở thành một động lực quan trọng.”\nXác định khu vực kinh tế tư nhân là động lực quan trọng; mục tiêu đến 2025 có ít nhất 1 triệu doanh nghiệp hoạt động hiệu quả.\nNghị quyết 11-NQ/TW: “Hoàn thiện thể chế kinh tế thị trường định hướng XHCN.”\nĐảm bảo kinh tế thị trường vận hành theo quy luật thị trường có quản lý của Nhà nước pháp quyền XHCN.\nNghị quyết 12-NQ/TW: “Tiếp tục cơ cấu lại, đổi mới, nâng cao hiệu quả DNNN.”\nCổ phần hóa, thoái vốn, tập trung lĩnh vực then chốt; khắc phục đầu tư dàn trải, thua lỗ kéo dài.",
      "Hội nghị Trung ương 6 khóa XII (10/2017)\nNghị quyết 18-NQ/TW: “Sắp xếp tổ chức bộ máy của hệ thống chính trị tinh gọn, hoạt động hiệu lực, hiệu quả.”\n“Tiếp tục đổi mới, sắp xếp tổ chức bộ máy của hệ thống chính trị tinh gọn, hoạt động hiệu lực, hiệu quả; bảo đảm nguyên tắc Đảng thống nhất lãnh đạo toàn diện nhưng phát huy vai trò chủ động, trách nhiệm của các cơ quan nhà nước.” (Phần Mục tiêu, Nghị quyết 18-NQ/TW, 2017.)\nTrọng tâm nội dung:\n- Giảm tầng nấc trung gian, hợp nhất một số cơ quan Đảng – Nhà nước có chức năng tương đồng.\n- Tinh giản biên chế 10% đến năm 2021.\n- Đổi mới cơ chế tự chủ của đơn vị sự nghiệp công.\nÝ nghĩa:\n→ Cụ thể hóa nhiệm vụ trọng tâm thứ 2 của Đại hội XII; mở đường cho cải cách hành chính và cải cách tiền lương.\nNghị quyết 19-NQ/TW: “Tiếp tục đổi mới hệ thống tổ chức và quản lý, nâng cao chất lượng, hiệu quả hoạt động của đơn vị sự nghiệp công lập.”\n“Giảm mạnh đầu mối, khắc phục tình trạng manh mún, chồng chéo, dàn trải; chuyển mạnh từ cơ chế Nhà nước bao cấp sang Nhà nước đặt hàng, giao nhiệm vụ, đấu thầu, khoán kinh phí.”",
      "Hội nghị Trung ương 7 khóa XII (5/2018)\nNghị quyết 26-NQ/TW: “Về công tác cán bộ.”\n“Công tác cán bộ là then chốt của then chốt; xây dựng đội ngũ cán bộ đủ phẩm chất, năng lực, uy tín, ngang tầm nhiệm vụ.”\n“Kiểm soát chặt chẽ quyền lực; chống chạy chức, chạy quyền, chạy bằng cấp.”\nNghị quyết 27-NQ/TW: “Cải cách chính sách tiền lương.”\n“Tiền lương phải là thu nhập chính, là động lực nâng cao hiệu quả công việc.”\n“Thực hiện chế độ tiền lương mới từ năm 2021, thống nhất toàn hệ thống chính trị.”\nNghị quyết 28-NQ/TW: “Cải cách chính sách bảo hiểm xã hội.”\nHướng tới bao phủ an sinh xã hội toàn dân, đảm bảo công bằng, bền vững.",
      "Hội nghị Trung ương 8 khóa XII (10/2018)\nNghị quyết 36-NQ/TW: “Chiến lược phát triển bền vững kinh tế biển Việt Nam đến năm 2030, tầm nhìn 2045.”\n“Phát triển bền vững kinh tế biển Việt Nam trên cơ sở tăng trưởng xanh, bảo tồn đa dạng sinh học, các hệ sinh thái biển; bảo đảm quốc phòng, an ninh, chủ quyền, quyền tài phán quốc gia trên biển, đảo.”\n“Đến năm 2030, Việt Nam trở thành quốc gia mạnh về biển, giàu từ biển, phát triển bền vững, thịnh vượng, an ninh và an toàn.”",
      "Ý nghĩa và tầm vóc của Đại hội XII\n“Đại hội XII đánh dấu bước chuyển giai đoạn của công cuộc đổi mới, từ đổi mới thể chế sang đổi mới toàn diện, đồng bộ; khẳng định vai trò lãnh đạo trung tâm của Đảng trong ổn định chính trị và phát triển đất nước; là nền tảng lý luận – thực tiễn cho Đại hội XIII (2021).” (Giáo trình Lịch sử ĐCSVN – Ban Tuyên giáo TW, tr.191.)\nĐại hội XII không chỉ tổng kết 30 năm đổi mới mà còn mở đường cho giai đoạn chuyển đổi số, hội nhập sâu rộng và phát triển bền vững.\nĐại hội XII là bước ngoặt của thời kỳ đổi mới toàn diện, với trọng tâm xây dựng Đảng – phát triển kinh tế – hội nhập quốc tế.\nLần đầu tiên, kinh tế tư nhân được thừa nhận là “một động lực quan trọng” trong nền kinh tế quốc dân.\nCác Hội nghị Trung ương khóa XII cụ thể hóa 6 nhiệm vụ trọng tâm thành chương trình hành động rõ ràng, hiệu quả.\nĐại hội XII chuẩn bị về tư tưởng, tổ chức, nhân sự và đường lối cho Đại hội XIII, định hướng phát triển đất nước đến năm 2045."
    ],

    "significance": [
      "Đại hội XII đánh dấu bước chuyển từ đổi mới thể chế sang đổi mới toàn diện, đồng bộ.",
      "Khẳng định vai trò lãnh đạo trung tâm của Đảng trong ổn định chính trị và phát triển đất nước.",
      "Lần đầu tiên kinh tế tư nhân được xác định là 'một động lực quan trọng' của nền kinh tế.",
      "Đại hội XII chuẩn bị nền tảng cho Đại hội XIII, định hướng phát triển đất nước đến năm 2045."
    ],
    "media": {
      "images": [
        {
          "src": "/images/dai-hoi-12-1.jpg",
          "caption": "Hình ảnh minh họa bối cảnh toàn cầu hóa"
        }
      ],
      "videoUrl": "/video/daihoi12.mp4"
    }
  },
  "XIII": {
    "id": "XIII",
    "title": "Đại hội đại biểu toàn quốc lần thứ XIII",
    "time": "25/01 - 01/02/2021",
    "location": "Hà Nội",
    "heroImage": "/images/dai-hoi-13-1.jpg",
    "context": [
      "Quốc tế: Tình hình thế giới chuyển biến sâu sắc dưới tác động của cách mạng công nghiệp 4.0, biến đổi khí hậu, và đặc biệt là đại dịch COVID-19 bùng phát toàn cầu.",
      "Cạnh tranh chiến lược giữa các nước lớn gay gắt, chủ nghĩa bảo hộ, dân túy gia tăng.",
      "Trong nước: Sau 35 năm đổi mới, Việt Nam đã đạt được những thành tựu to lớn, có ý nghĩa lịch sử, 'đất nước phát triển nhanh, bền vững hơn; vị thế và uy tín quốc tế ngày càng củng cố'.",
      "Tuy nhiên, kinh tế phát triển chưa bền vững, năng suất lao động thấp; tham nhũng, suy thoái, 'tự diễn biến' vẫn chưa được đẩy lùi triệt để."
    ],
    "contentHighlights": [
      {
        "title": "Khát vọng 2045",
        "description": "Lần đầu tiên đưa 'khát vọng phát triển đất nước phồn vinh, hạnh phúc' vào chủ đề Đại hội.",
        "source": "Mục tiêu 2045: Trở thành nước phát triển, thu nhập cao."
      },
      {
        "title": "Tầm nhìn chiến lược",
        "description": "Đề ra 3 mốc mục tiêu cụ thể: 2025 (vượt qua mức TNTB thấp), 2030 (nước có công nghiệp hiện đại, TNTB cao), 2045 (nước phát triển, thu nhập cao)."
      },
      {
        "title": "Chuyển đổi số",
        "description": "Chiến lược 2021-2030 nhấn mạnh 'phát triển nhanh và bền vững dựa chủ yếu vào khoa học, công nghệ, đổi mới sáng tạo và chuyển đổi số'.",
        "source": "Mục tiêu 2030: Kinh tế số chiếm khoảng 30% GDP."
      },
      {
        "title": "Chỉnh đốn Hệ thống Chính trị",
        "description": "Nhiệm vụ trọng tâm số 1 là 'Tăng cường xây dựng, chỉnh đốn Đảng và hệ thống chính trị trong sạch, vững mạnh'.",
        "source": "Hội nghị TW 4 (2021) mở rộng phạm vi chỉnh đốn ra toàn bộ hệ thống chính trị."
      },
      {
        "title": "Ba đột phá chiến lược",
        "description": "Hoàn thiện thể chế phát triển đồng bộ; phát triển nguồn nhân lực, đặc biệt nhân lực chất lượng cao; xây dựng hệ thống hạ tầng đồng bộ, hiện đại.",
        "source": "Văn kiện Đại hội XIII, Tập I, tr.132-133."
      },
      {
        "title": "Kiên định và phát triển sáng tạo chủ nghĩa Mác - Lênin, tư tưởng Hồ Chí Minh",
        "description": "Khẳng định bước phát triển mới trong tư duy lý luận của Đảng - không chỉ kiên định mà còn vận dụng, phát triển sáng tạo chủ nghĩa Mác - Lênin và tư tưởng Hồ Chí Minh trong điều kiện mới."
      }
    ],
    "fullContentSummary": [
      "Văn kiện và nội dung cơ bản của Đại hội XIII\nBối cảnh lịch sử\nĐại hội XIII của Đảng được tổ chức trong bối cảnh tình hình thế giới, khu vực và trong nước có nhiều diễn biến nhanh chóng, phức tạp và khó lường.\n“Thế giới, khu vực tiếp tục có nhiều diễn biến nhanh chóng, phức tạp, khó dự báo; cạnh tranh chiến lược giữa các nước lớn ngày càng gay gắt; dịch bệnh, thiên tai, biến đổi khí hậu diễn biến khó lường, tác động tiêu cực đến mọi mặt của đời sống quốc tế.\nTrong nước, sau 35 năm đổi mới, thế và lực, sức mạnh tổng hợp, uy tín quốc tế của nước ta lớn mạnh hơn bao giờ hết; song, kinh tế phát triển chưa bền vững, năng suất, chất lượng, hiệu quả và sức cạnh tranh còn thấp; công tác xây dựng, chỉnh đốn Đảng, đấu tranh phòng, chống tham nhũng, lãng phí, tiêu cực vẫn còn hạn chế.” (Văn kiện Đại hội XIII, Tập I, tr.21–23)\n→ Đại hội XIII tổng kết 35 năm đổi mới, 10 năm thực hiện Cương lĩnh (2011) và đề ra phương hướng phát triển đất nước đến năm 2030, tầm nhìn 2045.",

      "Chủ đề Đại hội\n“Tăng cường xây dựng, chỉnh đốn Đảng và hệ thống chính trị trong sạch, vững mạnh;\nKhơi dậy khát vọng phát triển đất nước phồn vinh, hạnh phúc;\nPhát huy ý chí, sức mạnh đại đoàn kết toàn dân tộc kết hợp với sức mạnh thời đại;\nTiếp tục đẩy mạnh toàn diện, đồng bộ công cuộc đổi mới;\nXây dựng và bảo vệ vững chắc Tổ quốc, giữ vững môi trường hòa bình, ổn định;\nPhấn đấu đến giữa thế kỷ XXI, nước ta trở thành nước phát triển theo định hướng xã hội chủ nghĩa.”\nNguồn: ĐCSVN (2021), Văn kiện Đại hội XIII, Tập I, tr.66–67.\nBa điểm mới nổi bật:\n 1. Gắn kết “Đảng và hệ thống chính trị” – khẳng định vai trò lãnh đạo toàn diện.\n 2. Đưa “khát vọng phát triển phồn vinh, hạnh phúc” – đặt con người ở trung tâm.\n 3. Mở rộng tầm nhìn chiến lược đến giữa thế kỷ XXI – hướng tới nước phát triển, thu nhập cao.",

      "Ba mốc mục tiêu: 2025 – 2030 – 2045\nĐến năm 2025: Là nước đang phát triển có công nghiệp theo hướng hiện đại, vượt qua mức thu nhập trung bình thấp.\nĐến năm 2030: Là nước đang phát triển có công nghiệp hiện đại, thu nhập trung bình cao.\nĐến năm 2045: Trở thành nước phát triển, thu nhập cao. (Văn kiện XIII, Tập I, tr.72–73)",

      "Các văn kiện quan trọng được thông qua tại Đại hội XIII\nĐại hội XIII đã thông qua 5 văn kiện lớn, trong đó Báo cáo chính trị được coi là văn kiện trung tâm, thể hiện toàn diện đường lối, chiến lược phát triển đất nước giai đoạn 2021–2030, tầm nhìn đến 2045.\nNhững văn kiện này không chỉ tổng kết 35 năm đổi mới mà còn định hướng phát triển đất nước trong kỷ nguyên chuyển đổi số và hội nhập quốc tế sâu rộng.",

      "🔹 Báo cáo chính trị của Ban Chấp hành Trung ương khóa XII\n“Phát huy ý chí và sức mạnh đại đoàn kết toàn dân tộc, kết hợp với sức mạnh thời đại;\nđẩy mạnh toàn diện, đồng bộ công cuộc đổi mới;\nxây dựng và bảo vệ vững chắc Tổ quốc, giữ vững môi trường hòa bình, ổn định;\nphấn đấu đến giữa thế kỷ XXI nước ta trở thành nước phát triển, theo định hướng xã hội chủ nghĩa.” (Văn kiện Đại hội XIII, Tập I, tr.75)\nTrọng tâm nội dung:\n  - Tổng kết 35 năm đổi mới, 30 năm Cương lĩnh 1991, và 10 năm Cương lĩnh (bổ sung, phát triển 2011).\n- Đề ra mục tiêu tổng quát 2021–2025, định hướng 2030, tầm nhìn 2045.\n- Nhấn mạnh “khát vọng phát triển đất nước phồn vinh, hạnh phúc”.\n- Đề cao vai trò Đảng lãnh đạo toàn diện, Nhà nước quản lý, Nhân dân làm chủ.\nÝ nghĩa: Báo cáo chính trị đóng vai trò “kim chỉ nam” cho toàn bộ hoạt động chính trị – kinh tế – xã hội nhiệm kỳ 2021–2026, khẳng định mục tiêu phát triển toàn diện gắn liền với chỉnh đốn Đảng.",

      "🔹 Báo cáo tổng kết Chiến lược phát triển KT-XH 2011–2020 và xây dựng Chiến lược 2021–2030\n“Phát triển nhanh và bền vững dựa chủ yếu vào khoa học, công nghệ, đổi mới sáng tạo và chuyển đổi số; đổi mới mô hình tăng trưởng, cơ cấu lại nền kinh tế, nâng cao năng suất, chất lượng, hiệu quả và sức cạnh tranh.” (Văn kiện Đại hội XIII, Tập I, tr.133)\nTrọng tâm nội dung:\n- Tổng kết 10 năm Chiến lược 2011–2020: đạt nhiều thành tựu nhưng vẫn còn bất cập trong năng suất lao động và đổi mới sáng tạo.\n- Đề ra định hướng 2021–2030: đổi mới mô hình tăng trưởng dựa trên khoa học – công nghệ, chuyển đổi số quốc gia.\n- Xây dựng nền kinh tế độc lập, tự chủ, gắn hội nhập quốc tế sâu rộng.\n- Đưa kinh tế số chiếm khoảng 30% GDP vào năm 2030.\n- Phát triển kinh tế tư nhân trở thành một động lực quan trọng.\nÝ nghĩa: Văn kiện này chuyển trọng tâm chiến lược phát triển đất nước sang kinh tế tri thức, công nghệ và đổi mới sáng tạo, khẳng định bước tiến lý luận mới của Đảng trong thời đại 4.0.",

      "🔹 Báo cáo đánh giá kết quả KT-XH 2016–2020, phương hướng 2021–2025\n“Đẩy mạnh cơ cấu lại nền kinh tế gắn với đổi mới mô hình tăng trưởng, phát triển kinh tế số, xã hội số; khuyến khích đổi mới sáng tạo, khởi nghiệp, phát triển mạnh khu vực kinh tế tư nhân.” (Văn kiện Đại hội XIII, Tập I, tr.141–142)\nTrọng tâm nội dung:\n- Tổng kết 2016–2020: tăng trưởng ~6%/năm (dù COVID-19), ổn định vĩ mô, kiểm soát lạm phát.\n- Phương hướng 2021–2025: phát triển kinh tế số, kinh tế xanh, tuần hoàn, thấp carbon.\n- Nâng cao năng lực nội sinh, sức chống chịu, thúc đẩy chuyển đổi số trong quản trị nhà nước và xã hội.\nÝ nghĩa: Báo cáo này cụ thể hóa mục tiêu phát triển KT-XH giai đoạn 5 năm đầu tiên trong Chiến lược 2021–2030, đặt nền móng cho chuyển đổi số quốc gia và kinh tế tri thức.",

      "🔹 Báo cáo tổng kết công tác xây dựng Đảng và thi hành Điều lệ Đảng khóa XII\n“Tiếp tục đẩy mạnh xây dựng, chỉnh đốn Đảng và hệ thống chính trị trong sạch, vững mạnh; kiên quyết, kiên trì đấu tranh phòng, chống tham nhũng, lãng phí, quan liêu.” (Văn kiện Đại hội XIII, Tập I, tr.180)\nTrọng tâm:\n- Tổng kết 5 năm triển khai Nghị quyết TW4 khóa XII về xây dựng, chỉnh đốn Đảng.\n- Xác định yêu cầu kiểm soát quyền lực, chống “chạy chức, chạy quyền”.\n- Đề cao phương châm “xây đi đôi với chống” trong công tác cán bộ.\nÝ nghĩa: Tạo tiền đề cho các Nghị quyết Trung ương khóa XIII (2022–2023) về chỉnh đốn Đảng và kiểm soát quyền lực.",

      "🔹 Báo cáo kiểm điểm sự lãnh đạo, chỉ đạo của Ban Chấp hành Trung ương khóa XII\n“Trung ương khóa XII đã lãnh đạo đất nước đạt nhiều thành tựu quan trọng; giữ vững ổn định chính trị, phát triển KT-XH, nâng cao vị thế đất nước; song vẫn còn hạn chế trong công tác dự báo, kiểm tra, giám sát, và công tác cán bộ.” (Văn kiện Đại hội XIII, Tập I, tr.198)\nTrọng tâm:\n- Kiểm điểm toàn diện vai trò lãnh đạo của BCH TW, Bộ Chính trị, Ban Bí thư khóa XII.\n- Thẳng thắn chỉ rõ hạn chế trong công tác cán bộ, chỉ đạo cải cách tiền lương, chống tham nhũng.\n- Là cơ sở rút kinh nghiệm cho BCH TW khóa XIII.",

      "Sáu nhiệm vụ trọng tâm của nhiệm kỳ XIII\n 1. Tăng cường xây dựng, chỉnh đốn Đảng và hệ thống chính trị trong sạch, vững mạnh.\n 2. Hoàn thiện đồng bộ thể chế phát triển, phát huy dân chủ XHCN, bảo đảm quyền con người.\n 3. Đổi mới mô hình tăng trưởng, cơ cấu lại nền kinh tế, đẩy mạnh CNH-HĐH gắn với kinh tế số.\n 4. Phát triển toàn diện văn hóa, con người Việt Nam.\n 5. Tăng cường quốc phòng, an ninh, bảo vệ Tổ quốc.\n 6. Chủ động, tích cực hội nhập quốc tế toàn diện, sâu rộng, hiệu quả.",

      "Hội nghị Trung ương 4 khóa XIII (4–7/10/2021)\n“Đẩy mạnh xây dựng, chỉnh đốn Đảng và hệ thống chính trị trong sạch, vững mạnh toàn diện.”\nTrọng tâm:\n- Mở rộng chỉnh đốn từ Đảng sang toàn hệ thống chính trị.\n- Nhấn mạnh yếu tố “toàn diện”: tư tưởng, đạo đức, tổ chức, kiểm soát quyền lực.\nÝ nghĩa: Kế thừa TW4 khóa XII, mở rộng phạm vi và chiều sâu, trở thành kim chỉ nam cho công tác xây dựng Đảng thời kỳ mới.",

      "Hội nghị Trung ương 5 khóa XIII (4–10/5/2022)\nThông qua 3 nghị quyết lớn:\n- NQ 18-NQ/TW: Tiếp tục hoàn thiện thể chế kinh tế thị trường định hướng XHCN.\n- NQ 19-NQ/TW: Về nông nghiệp, nông dân, nông thôn đến 2030, tầm nhìn 2045.\n- NQ 20-NQ/TW: Về đổi mới, phát triển và nâng cao hiệu quả kinh tế tập thể.\nÝ nghĩa: Ba nghị quyết tạo trụ cột cho thể chế – nông nghiệp – kinh tế tập thể, gắn chuyển đổi số và kinh tế xanh.",

      "Hội nghị Trung ương 6 khóa XIII (3–9/10/2022)\nTrọng tâm: Tiếp tục sắp xếp tổ chức bộ máy hệ thống chính trị tinh gọn, hoạt động hiệu lực, hiệu quả.\nÝ nghĩa: Kế thừa NQ18 (2017) khóa XII, mở rộng sang cấp địa phương, gắn cải cách tiền lương và đổi mới cơ chế tài chính.",

      "Hội nghị Trung ương 7 khóa XIII (15–20/5/2023)\nChủ đề: Xây dựng đội ngũ trí thức, phát triển giáo dục – đào tạo, khoa học – công nghệ.\n“Phát triển con người toàn diện và xây dựng xã hội học tập; lấy người học làm trung tâm; chuyển đổi số trong giáo dục, đào tạo và quản lý.” (Nghị quyết 29-NQ/TW, 2023)\nÝ nghĩa: Cụ thể hóa nhiệm vụ thứ tư của Đại hội XIII – phát triển con người, nguồn nhân lực chất lượng cao; nền tảng cho Chiến lược chuyển đổi số giáo dục đến 2030.",

      "Hội nghị Trung ương 8 khóa XIII (2–8/10/2023)\nNghị quyết 36-NQ/TW: “Chiến lược bảo vệ Tổ quốc trong tình hình mới.”\n“Kiên quyết, kiên trì bảo vệ vững chắc độc lập, chủ quyền, toàn vẹn lãnh thổ; chủ động phòng ngừa, phát hiện, ngăn chặn sớm các nguy cơ xung đột, chiến tranh từ sớm, từ xa.” (Nghị quyết 36-NQ/TW, 2023)\nÝ nghĩa: Cập nhật toàn diện Chiến lược Quốc phòng – An ninh; thể hiện tư duy “phòng ngừa từ sớm, giữ nước từ khi nước chưa nguy”.",

      "Hội nghị Trung ương 9 khóa XIII (2024)\nChủ đề: Tổng kết 3 năm thực hiện Nghị quyết Đại hội XIII, chuẩn bị Văn kiện Đại hội XIV.\nTrọng tâm:\n- Đánh giá giữa nhiệm kỳ thực hiện 6 nhiệm vụ trọng tâm và 3 đột phá chiến lược.\n- Rút kinh nghiệm công tác cán bộ, quy hoạch nhân sự Đại hội XIV.\n- Tiếp tục đẩy mạnh chỉnh đốn Đảng, chống tham nhũng, tiêu cực.\nÝ nghĩa: Bước tổng kết giữa nhiệm kỳ, củng cố thành tựu chống tham nhũng, chuẩn bị tiền đề cho Đại hội XIV (2026).",

      "Ý nghĩa và tầm vóc của Đại hội XIII\nĐại hội của khát vọng phát triển đất nước phồn vinh, hạnh phúc.\nĐại hội của chuyển đổi số, đổi mới sáng tạo, phát triển bền vững và chỉnh đốn Đảng toàn diện.\nTầm vóc lịch sử: Đặt nền tảng lý luận – thực tiễn cho Đại hội XIV, mở ra thời kỳ phát triển mới: Đổi mới toàn diện – Chuyển đổi số – Phát triển bền vững – Hội nhập quốc tế sâu rộng."
    ],
    "significance": [
      "Đại hội XIII là Đại hội của 'Khát vọng phát triển đất nước phồn vinh, hạnh phúc', thể hiện tư duy phát triển mới của Đảng.",
      "Khẳng định bước phát triển lý luận quan trọng: từ 'kiên định' đến 'phát triển sáng tạo' chủ nghĩa Mác - Lênin và tư tưởng Hồ Chí Minh.",
      "Là Đại hội của chuyển đổi số, đổi mới sáng tạo và phát triển bền vững, đưa Việt Nam vào thời kỳ kinh tế số - xã hội số.",
      "Đặt nền tảng chiến lược cho tầm nhìn 2045, chuẩn bị trực tiếp cho Đại hội XIV."
    ],
    "media": {
      "images": [
        {
          "src": "/images/dai-hoi-13-1.jpg",
          "caption": "Tổng Bí thư, Chủ tịch nước Nguyễn Phú Trọng đọc Báo cáo chính trị tại Đại hội XIII"
        }
      ],
      "videoUrl": "/video/daihoi13.mp4"
    }
  }
}
