{
  "VII": {
    "id": "VII",
    "title": "Đại hội đại biểu toàn quốc lần thứ VII",
    "time": "24 - 27/06/1991",
    "location": "Hà Nội",
    "heroImage": "/images/dai-hoi-7-1.jpg",
    "context": [
      "Sau 5 năm thực hiện đường lối đổi mới do Đại hội VI (1986) đề ra, đất nước ta đã đạt được những kết quả bước đầu quan trọng. Nền kinh tế dần thoát khỏi khủng hoảng từng phần, sản xuất có bước tăng trưởng, hàng hóa lưu thông tốt hơn, đời sống nhân dân được cải thiện.",
      "Tuy nhiên, tình hình kinh tế – xã hội nước ta vẫn còn nhiều khó khăn, hạn chế. Nền kinh tế chưa thật sự ổn định, tốc độ lạm phát còn cao, cơ cấu sản xuất chậm đổi mới. Cơ chế quản lý kinh tế mới còn thiếu đồng bộ. Tệ nạn xã hội, tham nhũng và quan liêu vẫn diễn ra ở nhiều nơi.",
      "Trong bối cảnh đó, yêu cầu đặt ra đối với Đảng và Nhà nước là phải tiếp tục công cuộc đổi mới một cách toàn diện và đồng bộ hơn nữa, tạo ra cơ sở lý luận và thực tiễn vững chắc cho con đường đi lên chủ nghĩa xã hội ở Việt Nam, đồng thời xây dựng một Cương lĩnh mới và Chiến lược phát triển kinh tế – xã hội dài hạn nhằm định hướng cho sự phát triển của đất nước trong giai đoạn mới."
    ],
    "contentHighlights": [
      {
        "title": "Cương lĩnh 1991",
        "description": "Thông qua \"Cương lĩnh xây dựng đất nước trong thời kỳ quá độ lên chủ nghĩa xã hội (1991)\", xác định con đường đi lên chủ nghĩa xã hội ở Việt Nam, nêu rõ mục tiêu, phương hướng và những nhiệm vụ cơ bản của thời kỳ quá độ lên CNXH."
      },
      {
        "title": "Chiến lược KTXH đến năm 2000",
        "description": "Thông qua \"Chiến lược ổn định và phát triển kinh tế – xã hội đến năm 2000\", đề ra mục tiêu xóa đói giảm nghèo, phát triển kinh tế, nâng cao đời sống nhân dân và chuyển dịch cơ cấu kinh tế theo hướng công nghiệp hóa."
      },
      {
        "title": "Các Hội nghị Trung ương và Nghị quyết",
        "description": "Sau Đại hội VII, Đảng đã tổ chức nhiều Hội nghị Trung ương và ban hành các nghị quyết quan trọng nhằm cụ thể hóa Cương lĩnh 1991 và Chiến lược phát triển kinh tế – xã hội đến năm 2000. Các nghị quyết này tập trung vào đẩy mạnh công nghiệp hóa, hiện đại hóa đất nước và xây dựng giai cấp công nhân trong giai đoạn mới."
      }
    ],
    "fullContentSummary": [
      "# Điểm mới nổi bật của Đại hội VII",
      "Đại hội VII thông qua **hai văn kiện quan trọng**:",
      "- *Cương lĩnh xây dựng đất nước trong thời kỳ quá độ lên chủ nghĩa xã hội (1991)*",
      "- *Chiến lược, ổn định và phát triển kinh tế- xã hội đến năm 2000*",
      "## Cương lĩnh xây dựng đất nước trong thời kỳ quá độ lên chủ nghĩa xã hội (1991)",
      "**Cương lĩnh 1991** gồm **4 phần**:",
      "1. Quá trình cách mạng và những bài học kinh nghiệm",
      "2. Quá độ lên chủ nghĩa xã hội ở nước ta",
      "3. Những định hướng lớn về chính sách kinh tế, xã hội, quốc phòng - an ninh, đối ngoại",
      "4. Hệ thống chính trị và vai trò lãnh đạo của Đảng",
      "Cương lĩnh nêu ra **7 phương hướng lớn xây dựng chủ nghĩa xã hội**:",
      "- **Xây dựng Nhà nước xã hội chủ nghĩa**",
      "- **Phát triển lực lượng sản xuất**, công nghiệp hóa đất nước theo hướng hiện đại gắn liền với phát triển một nền nông nghiệp toàn diện là **nhiệm vụ trung tâm**",
      "- **Thiết lập từng bước quan hệ sản xuất xã hội chủ nghĩa** từ thấp đến cao với sự đa dạng về hình thức sở hữu",
      "- **Phát triển nền kinh tế hàng hóa nhiều thành phần** theo định hướng xã hội chủ nghĩa, vận hành theo cơ chế thị trường có sự quản lý của Nhà nước",
      "- **Tiến hành cách mạng xã hội chủ nghĩa trên lĩnh vực tư tưởng, văn hóa**, làm cho thế giới quan Mác-Lênin, tư tưởng, đạo đức Hồ Chí Minh giữ vị trí chủ đạo trong đời sống tinh thần xã hội",
      "- **Thực hiện chính sách đại đoàn kết dân tộc**",
      "- **Thực hiện hai nhiệm vụ chiến lược**: xây dựng và bảo vệ Tổ quốc",
      "> Một trong các phương hướng nổi bật:",
      "> *“Phát triển lực lượng sản xuất, công nghiệp hóa đất nước theo hướng hiện đại gắn liền với phát triển một nền nông nghiệp toàn diện là nhiệm vụ trung tâm.”*",
      "Lần đầu tiên khái niệm **“công nghiệp hoá”** được nêu chính thức trong Cương lĩnh của Đảng và đi kèm với cụm **“theo hướng hiện đại”**, đánh dấu bước ngoặt trong tư duy **công nghiệp hoá, hiện đại hoá** đất nước.",
      "## Chiến lược ổn định và phát triển kinh tế – xã hội đến năm 2000 ",
      "Mục tiêu tổng quát: đưa đất nước ra khỏi khủng hoảng, ổn định kinh tế – xã hội, vượt qua tình trạng nghèo nàn, kém phát triển.",
      "Quan điểm chỉ đạo: phát triển kinh tế – xã hội gắn với củng cố độc lập dân tộc và xây dựng chủ nghĩa xã hội.",
      "Xây dựng xã hội: nhân dân làm chủ, công bằng, nhân ái, có văn hóa, kỷ cương, xoá bỏ áp bức, bất công; đảm bảo cuộc sống ấm no, tự do, hạnh phúc cho mọi người.",
      "Phát triển nền kinh tế hàng hóa nhiều thành phần, đa dạng hình thức sở hữu và tổ chức kinh doanh, vận hành theo cơ chế thị trường có sự quản lý của Nhà nước.",
      "Mục tiêu và động lực phát triển là **vì con người, do con người**, giải phóng sức sản xuất và khai thác tối đa tiềm năng của cá nhân, tập thể và cộng đồng.",
      "## Hội nghị Trung ương và Nghị quyết nổi bật",
      "**Hội nghị Trung ương 7 khóa VII (30/7/1994)** ban hành **Nghị quyết 07‑NQ/HNTW** về công nghiệp hóa, hiện đại hóa (CNH, HĐH) và xây dựng giai cấp công nhân.",
      "- **Công nghiệp hóa, hiện đại hóa** là quá trình chuyển đổi toàn diện các hoạt động sản xuất, kinh doanh, dịch vụ và quản lý từ lao động thủ công sang sử dụng công nghệ và phương pháp hiện đại, nâng cao năng suất lao động xã hội.",
      "- Mục tiêu: chuyển Việt Nam từ xã hội nông nghiệp lạc hậu sang xã hội công nghiệp với cơ sở vật chất – kỹ thuật hiện đại, cơ cấu kinh tế hợp lý, quan hệ sản xuất tiến bộ, đời sống vật chất và tinh thần cao, quốc phòng – an ninh vững chắc, dân giàu, nước mạnh, xã hội công bằng, văn minh.",
      "- Xây dựng **giai cấp công nhân**: phát triển về số lượng, trình độ, giác ngộ chính trị và tư tưởng, năng lực tiếp thu và sáng tạo công nghệ mới, lao động đạt năng suất và chất lượng cao.",
      "- Nâng cao **năng lực lãnh đạo của Đảng**, quản lý của Nhà nước, phát huy vai trò Mặt trận và các đoàn thể nhân dân trong công nghiệp hóa, hiện đại hóa.",
      "→ Nghị quyết xác định rõ **bản chất, nội dung, phương hướng và động lực** của công nghiệp hóa, hiện đại hóa đất nước."
    ],
    "significance": [
      " Giai đoạn này đã đặt nền móng quan trọng để chuyển đất nước sang thời kỳ đẩy mạnh công nghiệp hóa, hiện đại hóa, chuẩn bị điều kiện để Đại hội VIII (1996) đề ra chiến lược phát triển mới trong thời kỳ công nghiệp hoá, hiện đại hoá đất nước."
    ],
    "media": {
      "images": [
        {
          "src": "/images/dai-hoi-7-1.jpg",
          "caption": "Toàn cảnh Đại hội VII"
        },
        {
          "src": "/images/dai-hoi-7-2.jpg",
          "caption": "Toàn cảnh Đại hội VII (Ảnh đen trắng)"
        }
      ],
      "videoUrl": "/video/daihoi7.mp4"
    }
  },
  "VIII": {
    "id": "VIII",
    "title": "Đại hội đại biểu toàn quốc lần thứ VIII",
    "time": "28/06 - 01/07/1996",
    "location": "Hà Nội",
    "heroImage": "/images/dai-hoi-8-1.jpg",
    "context": [
      "Quốc tế: Cách mạng khoa học và công nghệ phát triển mạnh, nhưng chủ nghĩa xã hội hiện thực đang lâm vào thoái trào.",
      "Trong nước: Sau 10 năm đổi mới (1986-1996), đất nước đã đạt được những thắng lợi bước đầu rất quan trọng. Lạm phát được kiềm chế (từ 67,1% năm 1991 xuống 12,7% năm 1995).",
      "Đại hội tổng kết 10 năm đổi mới, khẳng định nước ta đã ra khỏi khủng hoảng kinh tế-xã hội, cho phép chuyển sang thời kỳ mới đẩy mạnh CNH, HĐH đất nước."
    ],
    "contentHighlights": [
      {
        "title": "Tổng kết 10 năm Đổi mới",
        "description": "Tổng kết 10 năm đổi mới và rút ra 6 bài học kinh nghiệm chủ yếu, khẳng định con đường đổi mới là đúng đắn."
      },
      {
        "title": "Bước ngoặt CNH, HĐH",
        "description": "Đánh dấu bước ngoặt, đưa đất nước sang thời kỳ mới: đẩy mạnh công nghiệp hóa, hiện đại hóa."
      },
      {
        "title": "Mục tiêu Xã hội",
        "description": "Bổ sung đặc trưng tổng quát về mục tiêu XHCN là: 'Dân giàu, nước mạnh, xã hội công bằng, văn minh'."
      },
      {
        "title": "Quốc sách hàng đầu",
        "description": "Hội nghị Trung ương 2 (12-1996) nhấn mạnh coi giáo dục-đào tạo cùng với khoa học và công nghệ là quốc sách hàng đầu."
      }
    ],
    "fullContentSummary": [
      "Đại hội VIII rút ra sáu bài học chủ yếu, bao gồm: Giữ vững mục tiêu ĐLDT và CNXH; Kết hợp đổi mới kinh tế (trọng tâm) với đổi mới chính trị; Xây dựng kinh tế hàng hoá nhiều thành phần; Phát huy sức mạnh đại đoàn kết toàn dân; Mở rộng hợp tác quốc tế; Tăng cường vai trò lãnh đạo của Đảng là nhiệm vụ then chốt. ",
      "Đại hội đề ra 6 quan điểm về CNH, HĐH trong thời kỳ mới, nhấn mạnh: Dựa vào nguồn lực trong nước là chính; CNH, HĐH là sự nghiệp của toàn dân; Lấy phát huy nguồn lực con người làm yếu tố cơ bản; Khoa học và công nghệ là động lực. ",
      "Hội nghị Trung ương 5 (7-1998) ban hành Nghị quyết 'Xây dựng và phát triển nền văn hoá Việt Nam tiên tiến, đậm đà bản sắc dân tộc', khẳng định văn hóa là nền tảng tinh thần, vừa là mục tiêu vừa là động lực."
    ],
    "significance": [
      "Đại hội VIII là một dấu mốc quan trọng, đánh dấu bước ngoặt đưa đất nước sang thời kỳ mới đẩy mạnh CNH, HĐH.",
      "Đại hội chính thức khẳng định nước ta đã ra khỏi khủng hoảng kinh tế-xã hội, đường lối đổi mới là đúng đắn, con đường đi lên CNXH ngày càng được xác định rõ hơn."
    ],
    "media": {
      "images": [
        {
          "src": "/images/dai-hoi-8-1.jpg",
          "caption": "Hình ảnh Đại hội VIII của Đảng"
        }
      ],
      "videoUrl": "/video/daihoi8.mp4"
    }
  },
  "IX": {
    "id": "IX",
    "title": "Đại hội đại biểu toàn quốc lần thứ IX",
    "time": "19 - 22/04/2001",
    "location": "Hà Nội",
    "heroImage": "/images/dai-hoi-9-1.jpg",
    "context": [
      "Đại hội IX họp tại Hà Nội từ ngày 19 đến 22/4/2001, với 1.168 đại biểu đại diện cho hơn 2,2 triệu đảng viên trong cả nước.",
      "Đại hội mở đầu thế kỷ XXI, trong bối cảnh cách mạng khoa học và công nghệ, kinh tế tri thức, toàn cầu hóa diễn ra mạnh mẽ.",
      "Sau sự kiện 11/9/2001, tình hình thế giới diễn biến phức tạp, các nước lớn tăng cường can thiệp vào công việc nội bộ nhiều quốc gia.",
      "Khu vực châu Á - Thái Bình Dương là khu vực phát triển năng động nhưng tiềm ẩn nhiều nhân tố gây mất ổn định.",
      "Trong nước, sau 15 năm đổi mới, đất nước đạt nhiều thành tựu: GDP từ 15,5 tỷ USD (1991) lên hơn 35 tỷ USD (2000), đời sống nhân dân cải thiện, vị thế quốc tế nâng cao.",
      "Tuy nhiên, kinh tế phát triển chưa vững chắc, hiệu quả và sức cạnh tranh còn thấp. Bốn nguy cơ (tụt hậu, chệch hướng, tham nhũng - quan liêu, 'diễn biến hòa bình') vẫn là thách thức lớn."
    ],
    "contentHighlights": [
      {
        "title": "Tư tưởng Hồ Chí Minh",
        "description": "Lần đầu tiên Đảng xác định rõ nội dung cơ bản của Tư tưởng Hồ Chí Minh là kết quả vận dụng sáng tạo chủ nghĩa Mác - Lênin vào điều kiện Việt Nam, kế thừa giá trị dân tộc và tinh hoa nhân loại. Được khẳng định là tài sản tinh thần vô giá, mãi mãi soi đường cho cách mạng Việt Nam."
      },
      {
        "title": "Mô hình Kinh tế Tổng quát",
        "description": "Khẳng định nền kinh tế thị trường định hướng xã hội chủ nghĩa là mô hình kinh tế tổng quát trong thời kỳ quá độ. Nền kinh tế nhiều thành phần, vận động theo cơ chế thị trường có sự quản lý của Nhà nước, phân phối theo lao động, hiệu quả và phúc lợi xã hội."
      },
      {
        "title": "Chiến lược Phát triển 2001-2010",
        "description": "Đại hội thông qua Chiến lược phát triển kinh tế - xã hội 10 năm (2001-2010), mục tiêu đưa Việt Nam ra khỏi tình trạng kém phát triển, tạo nền tảng để đến 2020 cơ bản trở thành nước công nghiệp hiện đại."
      },
      {
        "title": "Đường lối Đối ngoại và Hội nhập",
        "description": "Thực hiện đường lối đối ngoại độc lập, tự chủ, đa phương hoá, đa dạng hoá; chủ động hội nhập quốc tế. Việt Nam sẵn sàng là bạn, là đối tác tin cậy của cộng đồng quốc tế, phấn đấu vì hòa bình, độc lập và phát triển."
      },
      {
        "title": "Xây dựng Đảng và Hệ thống Chính trị",
        "description": "Tăng cường sự thống nhất trong Đảng về nhận thức, ý chí và hành động; kiên định chủ nghĩa Mác - Lênin, tư tưởng Hồ Chí Minh, độc lập dân tộc gắn liền với CNXH; kiên quyết đấu tranh chống bốn nguy cơ, không chấp nhận đa nguyên, đa đảng."
      },
      {
        "title": "Văn hóa và Công tác Tư tưởng",
        "description": "Xác định văn hóa là nền tảng tinh thần của xã hội, vừa là mục tiêu vừa là động lực phát triển. Xây dựng nền văn hóa tiên tiến, đậm đà bản sắc dân tộc; xây dựng con người Việt Nam phát triển toàn diện; giữ vững vai trò chủ đạo của chủ nghĩa Mác - Lênin và tư tưởng Hồ Chí Minh trong đời sống tinh thần."
      }
    ],
    "fullContentSummary": [
      "## Văn kiện và đường lối\n\n- Đại hội xác định rõ **nội dung cơ bản của Tư tưởng Hồ Chí Minh**, coi đây là **nền tảng tư tưởng** và **kim chỉ nam cho hành động** của toàn Đảng.\n- Khẳng định mô hình **kinh tế thị trường định hướng xã hội chủ nghĩa**, thông qua **Chiến lược phát triển kinh tế – xã hội 2001–2010**.",

      "## Phát triển kinh tế - xã hội và hội nhập\n\n- Đại hội nhấn mạnh phát triển kinh tế – xã hội, **hội nhập quốc tế**, xây dựng Đảng và hệ thống chính trị, phát triển **văn hóa và con người Việt Nam toàn diện**.",

      "## Một số Nghị quyết Trung ương tiêu biểu khóa IX\n\n- **Hội nghị TW 3 (9/2001):** Đổi mới, sắp xếp và nâng cao hiệu quả **doanh nghiệp nhà nước**.\n- **Hội nghị TW 5 (3/2002):** Phát triển **kinh tế tập thể và kinh tế tư nhân**; coi kinh tế tư nhân là **bộ phận cấu thành quan trọng** của nền kinh tế quốc dân.\n- **Hội nghị TW 7 (3/2003):** Ba nghị quyết về **đại đoàn kết dân tộc**, **công tác dân tộc**, **công tác tôn giáo**.\n- **Hội nghị TW 8 (7/2003):** Ban hành **Chiến lược bảo vệ Tổ quốc trong tình hình mới**.\n- **Nghị quyết 36 (3/2004):** Về **người Việt Nam ở nước ngoài** – xác định **kiều bào là bộ phận không tách rời** của dân tộc.",

      "## Ý nghĩa công nghiệp hóa – hiện đại hóa\n\n- Đánh dấu **bước ngoặt** trong sự nghiệp CNH – HĐH.\n- Xác định **mục tiêu chiến lược**: Đưa Việt Nam **cơ bản trở thành nước công nghiệp hiện đại vào năm 2020**.\n- Đề cao **đại đoàn kết toàn dân** như **động lực chủ yếu cho CNH, HĐH**."
    ],

    "significance": [
      "Đại hội IX đánh dấu bước ngoặt trong sự nghiệp công nghiệp hóa, hiện đại hóa đất nước; xác định mục tiêu lâu dài đến 2020 và định hình mô hình kinh tế tổng quát.",
      "Khẳng định bước trưởng thành về tư duy lý luận và thực tiễn đổi mới của Đảng, cụ thể hóa Cương lĩnh 1991.",
      "Đại hội đặt nền móng cho thời kỳ phát triển bền vững về kinh tế – xã hội và hội nhập quốc tế."
    ],
    "media": {
      "images": [
        {
          "src": "/images/dai-hoi-9-1.jpg",
          "caption": "Hình chụp toàn cảnh Hội trường Đại hội IX của Đảng, Hà Nội, 4/2001"
        },
        {
          "src": "/images/dai-hoi-9-2.jpg",
          "caption": "Đồng chí Nông Đức Mạnh tại Đại hội IX, 2001"
        },
        {
          "src": "/images/dai-hoi-9-3.jpg",
          "caption": "Hội nghị Bộ trưởng APEC lần thứ 18 tại Hà Nội, tháng 11/2006"
        },
        {
          "src": "/images/dai-hoi-9-4.jpg",
          "caption": "Khởi công xây dựng nhà máy LEGO 1,3 tỷ USD tại Bình Dương"
        }
      ],
      "videoUrl": "/video/daihoi9.mp4"
    }
  },
  "X": {
    "id": "X",
    "title": "Đại hội đại biểu toàn quốc lần thứ X",
    "time": "18 - 25/04/2006",
    "location": "Hà Nội",
    "heroImage": "/images/dai-hoi-10-1.jpg",
    "context": [
      "**Trong nước:** Đất nước đã trải qua 20 năm đổi mới, đạt nhiều thành tựu to lớn có ý nghĩa lịch sử. Thế và lực, uy tín quốc tế của Việt Nam tăng lên rõ rệt.\n\n**Quốc tế:** Tình hình thế giới diễn biến nhanh, phức tạp, khó lường. Toàn cầu hóa và hội nhập quốc tế vừa là cơ hội, vừa là thách thức. Tiếp tục đổi mới toàn diện để xây dựng và bảo vệ Tổ quốc trong điều kiện mới."
    ],
    "contentHighlights": [
      {
        "title": "Tổng kết 20 năm Đổi mới",
        "description": "Đại hội tổng kết lý luận và thực tiễn 20 năm đổi mới, rút ra 5 bài học kinh nghiệm về kiên định mục tiêu độc lập dân tộc gắn liền với CNXH, đổi mới toàn diện và đồng bộ, phát huy vai trò của nhân dân, kết hợp nội lực với ngoại lực và nâng cao năng lực lãnh đạo của Đảng."
      },
      {
        "title": "Nhận thức mới về Xã hội Xã hội chủ nghĩa",
        "description": "Đại hội bổ sung và diễn đạt lại các đặc trưng của xã hội XHCN mà nhân dân ta xây dựng, gồm 8 đặc trưng cơ bản như dân giàu, nước mạnh, công bằng, dân chủ, văn minh; do nhân dân làm chủ; có Nhà nước pháp quyền XHCN của nhân dân, do nhân dân, vì nhân dân."
      },
      {
        "title": "Xây dựng, chỉnh đốn Đảng – Nhiệm vụ then chốt",
        "description": "Lần đầu tiên Đại hội đặt nhiệm vụ xây dựng, chỉnh đốn Đảng ở vị trí hàng đầu trong chủ đề Đại hội. Làm rõ bản chất Đảng Cộng sản Việt Nam là đội tiên phong của giai cấp công nhân, nhân dân lao động và của dân tộc Việt Nam."
      },
      {
        "title": "Đảng viên làm kinh tế tư nhân",
        "description": "Đại hội X cho phép đảng viên làm kinh tế tư nhân, kể cả tư bản tư nhân, nhưng phải tuân thủ Điều lệ Đảng, nghị quyết của Đảng và quy định của pháp luật Nhà nước."
      },
      {
        "title": "Phát huy sức mạnh toàn dân tộc",
        "description": "Xóa bỏ mặc cảm, định kiến, tôn trọng những ý kiến khác nhau không trái lợi ích dân tộc; xây dựng đồng thuận xã hội, đề cao truyền thống nhân nghĩa, khoan dung, tinh thần cởi mở và tin cậy lẫn nhau."
      },
      {
        "title": "Đẩy mạnh CNH, HĐH gắn với kinh tế tri thức",
        "description": "Đại hội xác định CNH, HĐH là nhiệm vụ trung tâm, gắn với phát triển kinh tế tri thức và hội nhập quốc tế, hoàn thiện thể chế kinh tế thị trường định hướng XHCN."
      },
      {
        "title": "Văn hóa và Công tác Tư tưởng",
        "description": "Xác định văn hóa là nền tảng tinh thần của xã hội, vừa là mục tiêu vừa là động lực phát triển. Làm cho chủ nghĩa Mác - Lênin và tư tưởng Hồ Chí Minh giữ vai trò chủ đạo trong đời sống tinh thần, đẩy mạnh đấu tranh làm thất bại âm mưu 'diễn biến hòa bình'."
      }
    ],
    "fullContentSummary": [
      "## Nhiệm vụ trọng tâm và các Chủ trương nổi bật\n\nĐại hội X lần đầu tiên đặt chú trọng hàng đầu đến **nhiệm vụ then chốt là xây dựng, chỉnh đốn Ðảng**, coi đây là **thành tố đầu tiên của chủ đề Đại hội**.\n\n### Về Xây dựng Đảng (Nhiệm vụ then chốt)\n- Đảng phải **nâng cao năng lực hoạch định đường lối, chính sách**, **năng lực tổ chức chỉ đạo thực hiện**, **tổng kết lý luận thực tiễn**.\n- Làm sáng tỏ bản chất của Ðảng:\n\n> “**Ðảng Cộng sản Việt Nam** là **đội tiên phong của giai cấp công nhân**, đồng thời là **đội tiên phong của nhân dân lao động và của dân tộc Việt Nam**; **đại biểu trung thành lợi ích của giai cấp công nhân, của nhân dân lao động và của dân tộc.**”\n\n- Đại hội X cho phép **đảng viên làm kinh tế tư nhân**, kể cả **tư bản tư nhân**, nhưng yêu cầu phải **tuân thủ Điều lệ Đảng**, **nghị quyết của Đảng** và **pháp luật Nhà nước**.\n\n### Về Phát huy sức mạnh toàn dân tộc\n- Cần lấy **mục tiêu chung của toàn dân tộc:**\n\n> “**Giữ vững độc lập, thống nhất của Tổ quốc, vì dân giàu, nước mạnh, xã hội công bằng, dân chủ, văn minh.**”\n\n- **Đoàn kết rộng rãi:** Xóa bỏ mọi **mặc cảm**, **định kiến**, **phân biệt đối xử** về quá khứ, thành phần giai cấp; **tôn trọng ý kiến khác nhau** không trái với lợi ích dân tộc.\n- **Xây dựng đồng thuận xã hội:** Đề cao **truyền thống nhân nghĩa**, **khoan dung**, xây dựng **tinh thần cởi mở, tin cậy lẫn nhau** vì **ổn định chính trị và đồng thuận xã hội**.\n\n### Về Đẩy mạnh toàn diện công cuộc đổi mới\n- **Tiếp tục hoàn thiện thể chế kinh tế thị trường định hướng xã hội chủ nghĩa.**\n- **Đẩy mạnh công nghiệp hoá, hiện đại hoá** gắn với **phát triển kinh tế tri thức.**\n- **Mở rộng quan hệ đối ngoại**, **chủ động, tích cực hội nhập kinh tế quốc tế.**",

      "## Một số Nghị quyết Trung ương tiêu biểu khóa X\n\n- **Hội nghị TW 4 (02/2007):** Ban hành **Chiến lược biển Việt Nam đến năm 2020**, xác định mục tiêu đưa nước ta trở thành **quốc gia mạnh về biển, giàu lên từ biển.**\n- **Hội nghị TW 5 (7/2007):** Ban hành nghị quyết **tăng cường công tác kiểm tra, giám sát của Đảng**, góp phần giữ vững **kỷ luật, kỷ cương**, nâng cao **năng lực lãnh đạo của Đảng.**\n- **Hội nghị TW 6 (01/2008):** Tiếp tục **hoàn thiện thể chế kinh tế thị trường định hướng xã hội chủ nghĩa** và đẩy mạnh **phòng, chống tham nhũng, lãng phí.**\n- **Hội nghị TW 7 (7/2008):** Thông qua nghị quyết về **nông nghiệp, nông dân, nông thôn (tam nông)**, xác định đây là **vấn đề chiến lược** trong quá trình **công nghiệp hóa, hiện đại hóa đất nước.**\n- **Hội nghị TW 8 (2009):** Tổng kết **10 năm thực hiện Chiến lược biển Việt Nam**, đề ra **phương hướng phát triển kinh tế biển gắn với bảo vệ chủ quyền quốc gia.**",

      "## Ý nghĩa về Công nghiệp hoá, Hiện đại hoá (CNH, HĐH)\n\n- **Đánh dấu bước ngoặt quan trọng** trong tiến trình **CNH, HĐH**: Đại hội X xác định đây là **nhiệm vụ trung tâm** của thời kỳ quá độ lên **CNXH**, thể hiện **nhận thức trưởng thành** và **quyết tâm đổi mới toàn diện**.\n- **Xác định mục tiêu chiến lược:** Đưa nước ta **thoát khỏi tình trạng kém phát triển**.\n- **Gắn CNH, HĐH** với **phát triển bền vững** và **kinh tế tri thức**.\n- **Tạo sức mạnh tổng hợp mới** cho đất nước.\n- **Đặt nền tảng cho chiến lược phát triển giai đoạn 2011–2020.**"
    ],
    "significance": [
      "Đại hội X là dấu mốc quan trọng trong tiến trình đổi mới toàn diện đất nước, khẳng định sự trưởng thành về bản lĩnh chính trị, tư duy lý luận và năng lực lãnh đạo của Đảng trong bối cảnh toàn cầu hóa và hội nhập quốc tế sâu rộng.\nLà bước phát triển mới trong việc cụ thể hóa Cương lĩnh 1991 và Chiến lược phát triển kinh tế – xã hội 2001–2010, góp phần làm sáng tỏ hơn con đường đi lên chủ nghĩa xã hội ở Việt Nam.\nKhẳng định đường lối đổi mới là đúng đắn, sáng tạo và phù hợp thực tiễn Việt Nam, tiếp tục hoàn thiện nhận thức về CNH, HĐH gắn với phát triển kinh tế tri thức và chủ động hội nhập kinh tế quốc tế.\nĐặt nền tảng cho giai đoạn phát triển mới của đất nước, hướng tới mục tiêu dân giàu, nước mạnh, xã hội công bằng, dân chủ, văn minh, đồng thời củng cố niềm tin của nhân dân vào sự lãnh đạo của Đảng và con đường xã hội chủ nghĩa."
    ],
    "media": {
      "images": [
        {
          "src": "/images/dai-hoi-10-1.jpg",
          "caption": "Đại hội đại biểu toàn quốc lần thứ X, năm 2006"
        },
        {
          "src": "/images/dai-hoi-10-2.jpg",
          "caption": "Tổng bí thư Nông Đức Mạnh tái đắc cử"
        },
        {
          "src": "/images/dai-hoi-10-3.jpg",
          "caption": "Việt Nam chính thức là thành viên thứ 150 của WTO"
        },
        {
          "src": "/images/dai-hoi-10-4.jpg",
          "caption": "Nhà máy lọc dầu Dung Quất – công trình trọng điểm quốc gia thời kỳ 2006-2011"
        }
      ],
      "videoUrl": "/video/daihoi10.mp4"
    }
  },
  "XI": {
    "id": "XI",
    "title": "Đại hội đại biểu toàn quốc lần thứ XI",
    "time": "12 - 19/01/2011",
    "location": "Hà Nội",
    "heroImage": "/images/dai-hoi-11-1.jpg",
    "context": [
      "Đại hội XI diễn ra trong bối cảnh đất nước đang bước vào giai đoạn công nghiệp hóa – hiện đại hóa. Nền kinh tế – xã hội đã đạt nhiều kết quả tích cực, nhưng vẫn còn những hạn chế như năng suất lao động chưa cao, cơ chế quản lý chưa đồng bộ, cùng tình trạng tham nhũng, quan liêu.",
      "Trên thế giới, cuộc cách mạng khoa học – công nghệ, toàn cầu hóa và kinh tế tri thức phát triển mạnh mẽ. Đồng thời, các mâu thuẫn về chính trị, kinh tế, an ninh vẫn diễn ra phức tạp, đặc biệt ở khu vực châu Á – Thái Bình Dương, đặt ra yêu cầu cho Việt Nam phải tăng cường hội nhập quốc tế và ứng phó với thách thức mới.",
      "Trong bối cảnh đó, Đại hội XI đề ra định hướng phát triển đất nước đến năm 2020, theo Cương lĩnh 2011, nhấn mạnh phát triển nền kinh tế thị trường định hướng xã hội chủ nghĩa với nhiều thành phần kinh tế cùng tồn tại, phát triển kinh tế gắn với nâng cao đời sống nhân dân, củng cố quốc phòng – an ninh, xây dựng Đảng trong sạch, vững mạnh. Đồng thời, Đại hội xác định đổi mới mô hình tăng trưởng, nâng cao năng lực cạnh tranh, bảo đảm tiến trình công nghiệp hóa – hiện đại hóa và hội nhập sâu rộng với thế giới, góp phần xây dựng xã hội dân giàu, nước mạnh, dân chủ, công bằng, văn minh."
    ],
    "contentHighlights": [
      {
        "title": "Cương lĩnh(bổ sung, 2011)",
        "description": "Thông qua \"Cương lĩnh xây dựng đất nước trong thời kỳ quá độ lên chủ nghĩa xã hội (bổ sung, phát triển năm 2011)\", khẳng định định hướng xây dựng xã hội dân giàu, nước mạnh, dân chủ, công bằng, văn minh, củng cố vai trò lãnh đạo của Đảng và bổ sung các nhận thức, phương hướng phát triển đất nước trong bối cảnh mới."
      },
      {
        "title": "Chiến lược 2011-2020",
        "description": "Thông qua \"Chiến lược phát triển kinh tế-xã hội 2011-2020\", xác định quan điểm phát triển nhanh, bền vững, đề ra ba đột phá chiến lược và định hướng đổi mới mô hình tăng trưởng, cơ cấu lại nền kinh tế, hoàn thiện bộ máy Nhà nước, cải cách hành chính, phòng chống tham nhũng, phát huy quyền làm chủ của nhân dân, với mục tiêu xây dựng Việt Nam “dân giàu, nước mạnh, dân chủ, công bằng, văn minh”."
      },
      {
        "title": "Các Hội nghị Trung ương và Nghị quyết",
        "description": "Các Hội nghị Trung ương tập trung đột phá về kinh tế, xây dựng Đảng, giáo dục, văn hóa và quốc phòng, cụ thể hóa các mục tiêu của Cương lĩnh 2011, đồng thời tự đổi mới, tự chỉnh đốn Đảng, nâng cao hiệu quả quản lý Nhà nước, thúc đẩy phát triển bền vững đất nước và xây dựng Việt Nam trở thành quốc gia công nghiệp hiện đại."
      }
    ],
    "fullContentSummary": [
      "# Điểm mới nổi bật của Đại hội XI",
      "Đại hội XI thông qua **hai văn kiện quan trọng**:",
      "- *Cương lĩnh xây dựng đất nước trong thời kỳ quá độ lên chủ nghĩa xã hội (bổ sung, phát triển năm 2011)*",
      "- *Chiến lược phát triển kinh tế-xã hội 2011-2020*",
      "## Cương lĩnh xây dựng đất nước trong thời kỳ quá độ lên chủ nghĩa xã hội (bổ sung, phát triển năm 2011)",
      "Cương lĩnh có kết cấu **4 phần** cơ bản giữ như Cương lĩnh năm 1991 có bổ sung, phát triển nhận thức mới ở tiêu đề và nội dung từng phần:",
      "1. Quá trình cách mạng và những bài học kinh nghiệm",
      "Cương lĩnh khẳng định những bài học kinh nghiệm lớn:",
      "- Một là, nắm vững ngọn cờ độc lập dân tộc và chủ nghĩa xã hội.",
      "- Hai là, sự nghiệp cách mạng là của nhân dân, do nhân dân và vì nhân dân. - (Bổ sung vào nội dung: “Quan liêu, tham nhũng, xa rời nhân dân, sẽ dẫn đến những tổn thất khôn lường đối với vận mệnh của đất nước, của chế độ xã hội chủ nghĩa và của Đảng”.",
      "- Ba là, không ngừng củng cố, tăng cường đoàn kết, đoàn kết toàn Đảng, đoàn kết toàn dân, đoàn kết dân tộc, đoàn kết quốc tế.",
      "- Bốn là, kết hợp sức mạnh dân tộc với sức mạnh thời đại, sức mạnh trong nước với sức mạnh quốc tế.",
      "- Năm là, sự lãnh đạo đúng đắn của Đảng là nhân tố hàng đầu **quyết định** thắng lợi của cách mạng Việt Nam. (sửa đổi từ \"đảm bảo\" thành \"quyết định\") ",
      "2. Quá độ lên chủ nghĩa xã hội ở nước ta",
      "- Cuộc cách mạng khoa học – công nghệ, kinh tế tri thức và toàn cầu hóa diễn ra mạnh mẽ.",
      "- Hòa bình, độc lập dân tộc, dân chủ, hợp tác và phát triển là xu thế lớn, nhưng các mâu thuẫn cơ bản trên thế giới vẫn phức tạp.",
      "- Đặc điểm nổi bật của thời đại là các quốc gia với chế độ và trình độ phát triển khác nhau vừa hợp tác vừa đấu tranh vì lợi ích dân tộc. Dù gặp nhiều khó khăn, cuộc đấu tranh của nhân dân vì hòa bình, độc lập, dân chủ và tiến bộ xã hội vẫn tiếp tục phát triển; “Theo quy luật tiến hoá của lịch sử, loài người nhất định sẽ tiến tới chủ nghĩa xã hội”",
      "3. Những định hướng lớn về chính sách kinh tế, xã hội, quốc phòng - an ninh, đối ngoại",
      "Cương lĩnh 2011 xác định xã hội chủ nghĩa Việt Nam là: “dân giàu, nước mạnh, dân chủ, công bằng, văn minh”, do nhân dân làm chủ, có nền kinh tế phát triển cao, văn hóa tiên tiến, đậm đà bản sắc dân tộc, con người ấm no, tự do, hạnh phúc, các dân tộc bình đẳng, đoàn kết, và Nhà nước pháp quyền xã hội chủ nghĩa do Đảng Cộng sản lãnh đạo.",
      "Bổ sung hai đặc trưng bao trùm: “Dân giàu, nước mạnh, dân chủ, công bằng, văn minh” và “Nhà nước pháp quyền xã hội chủ nghĩa của nhân dân, do nhân dân, vì nhân dân”, đồng thời diễn đạt các đặc trưng khác rõ ràng, toàn diện hơn.",
      "Xây dựng chủ nghĩa xã hội là quá trình cách mạng sâu sắc, lâu dài, với sự đấu tranh giữa cái cũ và cái mới trên mọi lĩnh vực.",
      "Mục tiêu đến giữa thế kỷ XXI: xây dựng Việt Nam trở thành nước công nghiệp hiện đại theo định hướng xã hội chủ nghĩa, có nền tảng kinh tế, chính trị, tư tưởng, văn hóa phù hợp.",
      "**8 phương hướng cơ bản** xây dựng chủ nghĩa xã hội ở nước ta:",
      "- Một là, đẩy mạnh công nghiệp hoá, hiện đại hoá đất nước gắn với phát triển kinh tế tri thức, bảo vệ tài nguyên, môi trường.",
      "- Hai là, phát triển nền kinh tế thị trường định hướng xã hội chủ nghĩa.",
      "- Ba là, xây dựng nền văn hoá tiên tiến, đậm đà bản sắc dân tộc; xây dựng con người, nâng cao đời sống nhân dân, thực hiện tiến bộ và công bằng xã hội.",
      "- Bốn là, bảo đảm vững chắc quốc phòng và an ninh quốc gia, trật tự, an toàn xã hội.",
      "- Năm là, thực hiện đường lối đối ngoại độc lập, tự chủ, hoà bình, hữu nghị, hợp tác và phát triển; chủ động và tích cực hội nhập quốc tế.",
      "- Sáu là, xây dựng nền dân chủ xã hội chủ nghĩa, thực hiện đại đoàn kết toàn dân tộc, tăng cường và mở rộng mặt trận dân tộc thống nhất.",
      "- Bảy là, xây dựng Nhà nước pháp quyền xã hội chủ nghĩa của nhân dân, do nhân dân, vì nhân dân.",
      "- Tám là, xây dựng Đảng trong sạch, vững mạnh.",
      "Nắm vững và giải quyết tốt **8 mối quan hệ lớn**:",
      "- Quan hệ giữa đổi mới, ổn định và phát triển.",
      "- Quan hệ giữa đổi mới kinh tế và đổi mới chính trị.",
      "- Quan hệ giữa kinh tế thị trường và định hướng xã hội chủ nghĩa.",
      "- Quan hệ giữa phát triển lực lượng sản xuất và xây dựng, hoàn thiện từng bước quan hệ sản xuất xã hội chủ nghĩa.",
      "- Quan hệ giữa tăng trưởng kinh tế và phát triển văn hoá, thực hiện tiến bộ và công bằng xã hội.",
      "- Quan hệ giữa xây dựng chủ nghĩa xã hội và bảo vệ Tổ quốc xã hội chủ nghĩa.",
      "- Quan hệ giữa độc lập, tự chủ và hội nhập quốc tế.",
      "- Quan hệ giữa Đảng lãnh đạo, Nhà nước quản lý, nhân dân làm chủ.",
      "Phát triển nền kinh tế thị trường định hướng xã hội chủ nghĩa với nhiều hình thức sở hữu, nhiều thành phần kinh tế cùng tồn tại và cạnh tranh bình đẳng theo pháp luật.",
      "Kinh tế nhà nước giữ vai trò chủ đạo.",
      "Kinh tế tập thể được củng cố và phát triển.",
      "Kinh tế tư nhân là một trong những động lực của nền kinh tế.",
      "Kinh tế có vốn đầu tư nước ngoài được khuyến khích phát triển.",
      "Giáo dục và đào tạo là **quốc sách hàng đầu**, có sứ mệnh nâng cao dân trí, phát triển nhân lực, bồi dưỡng nhân tài, gắn với khoa học – công nghệ. “Đầu tư cho giáo dục đào tạo là đầu tư phát triển”",
      "4. Hệ thống chính trị và vai trò lãnh đạo của Đảng",
      "Về Đảng Cộng sản Việt Nam, bổ sung cách diễn đạt bản chất của Đảng: Đảng Cộng sản Việt Nam là đội tiên phong của giai cấp công nhân, đồng thời là đội tiên phong của nhân dân lao động và của dân tộc Việt Nam; đại biểu trung thành lợi ích của giai cấp công nhân, nhân dân lao động và của dân tộc.",
      "Đảng lãnh đạo bằng cương lĩnh, chiến lược, các định hướng về chính sách và chủ trương lớn",
      "## Chiến lược phát triển kinh tế-xã hội 2011-2020",
      "Phát triển nhanh gắn liền với phát triển bền vững là yêu cầu xuyên suốt trong Chiến lược. Đổi mới đồng bộ, phù hợp về kinh tế và chính trị vì mục tiêu xây dựng nước Việt Nam “dân giàu, nước mạnh, dân chủ, công bằng, văn minh”",
      "**3 đột phá chiến lược:**",
      "- Hoàn thiện thể chế kinh tế thị trường định hướng XHCN.",
      "- Phát triển nhanh nguồn nhân lực, nhất là chất lượng cao.",
      "- Xây dựng kết cấu hạ tầng đồng bộ, hiện đại.",
      "Định hướng phát triển kinh tế-xã hội:",
      "- Đổi mới mô hình tăng trưởng, cơ cấu lại nền kinh tế; thực hiện tốt chức năng của Nhà nước, giải quyết đúng đắn mối quan hệ giữa Nhà nước với thị trường.",
      "- Hoàn thiện bộ máy nhà nước, chuyển mạnh về cải cách hành chính; đẩy mạnh đấu tranh phòng, chống tham nhũng, lãng phí.",
      "- Tăng cường sự lãnh đạo của Đảng, phát huy quyền làm chủ của nhân dân trong việc xây dựng bộ máy nhà nước.",
      "## Các Hội nghị Trung ương và Nghị quyết:",
      "Hội nghị Trung ương 4 (2012): Xây dựng kết cấu hạ tầng đồng bộ; phòng, chống suy thoái tư tưởng, đạo đức cán bộ; tăng cường lãnh đạo Đảng trong phòng, chống tham nhũng, lãng phí.",
      "Hội nghị Trung ương 5 (2012): Tổng kết chính sách đất đai; khẳng định đất đai là tài nguyên quốc gia quý giá và nguồn lực to lớn.",
      "Hội nghị Trung ương 6 (2012): Đổi mới, nâng cao hiệu quả doanh nghiệp nhà nước; tái lập Ban Kinh tế và Ban Nội chính Trung ương; đánh giá kiểm điểm tự phê bình, phê bình theo Nghị quyết Trung ương 4.",
      "Hội nghị Trung ương 7 (2013): Hoàn thiện Hiến pháp 1992 (dẫn đến Hiến pháp 2013); tăng cường, đổi mới công tác dân vận.",
      "Hội nghị Trung ương 8 (2013): Nghị quyết về đổi mới căn bản, toàn diện giáo dục và đào tạo; Chiến lược bảo vệ Tổ quốc trong tình hình mới.",
      "Hội nghị Trung ương 9 (2014): Xây dựng và phát triển văn hóa, con người Việt Nam; văn hóa là nền tảng tinh thần và động lực phát triển bền vững.",
      "→ Các hội nghị và nghị quyết ban hành thể hiện sự tập trung của Đảng vào việc thực hiện đường lối đổi mới đã được hoạch định tại Đại hội VI, cụ thể hóa các mục tiêu xây dựng chủ nghĩa xã hội trong Cương lĩnh 2011, đồng thời nỗ lực tự đổi mới, tự chỉnh đốn Đảng để khắc phục những hạn chế, khuyết điểm kéo dài.",
      "## Nhìn lại tiến trình công nghiệp hóa – hiện đại hóa qua các cương lĩnh của các kỳ đại hội",
      "Đại hội VII (1991) – Cương lĩnh 1991: Nhấn mạnh công nghiệp hóa – hiện đại hóa bước đầu, với trọng tâm là phát triển sản xuất, củng cố hạ tầng và ổn định chính trị.",
      "Đại hội XI (2011) – Cương lĩnh 2011: Hoàn thiện công nghiệp hóa – hiện đại hóa theo hướng bền vững, chất lượng cao, ứng dụng công nghệ tiên tiến, đồng thời kết hợp phát triển xã hội, nâng cao chất lượng nguồn nhân lực và hội nhập quốc tế.",
      "Nói cách khác, Đại hội XI kế thừa mục tiêu của Đại hội VII nhưng mở rộng, nâng cao và hiện đại hóa hơn, phù hợp với bối cảnh hội nhập quốc tế và yêu cầu phát triển bền vững của đất nước."
    ],
    "significance": [
      "Đại hội XI và các nghị quyết sau Đại hội đánh dấu bước phát triển mới trong quá trình xây dựng chủ nghĩa xã hội ở Việt Nam, vừa tiếp tục đổi mới toàn diện, vừa nâng cao vai trò lãnh đạo của Đảng, tạo nền tảng cho phát triển bền vững, hội nhập quốc tế, giữ vững độc lập, tự chủ và ổn định chính trị xã hội."
    ],
    "media": {
      "images": [
        {
          "src": "/images/dai-hoi-11-1.jpg",
          "caption": "Toàn cảnh Đại hội XI của Đảng"
        }
      ],
      "videoUrl": "/video/daihoi11.mp4"
    }
  },
  "XII": {
    "id": "XII",
    "title": "Đại hội đại biểu toàn quốc lần thứ XII",
    "time": "20 - 28/01/2016",
    "location": "Hà Nội",
    "heroImage": "/images/dai-hoi-12-1.jpg",
    "context": [
      "Sau 30 năm đổi mới (1986–2016), Việt Nam đã đạt được thành tựu to lớn và có ý nghĩa lịch sử, đất nước thoát khỏi khủng hoảng kinh tế – xã hội kéo dài, bước vào thời kỳ phát triển ổn định, hội nhập quốc tế sâu rộng.",
      "Tuy nhiên, tình hình thế giới và khu vực diễn biến nhanh, phức tạp, khó lường: cạnh tranh chiến lược giữa các nước lớn gia tăng; các vấn đề an ninh phi truyền thống (biến đổi khí hậu, an ninh mạng, dịch bệnh, khủng bố) tác động mạnh đến khu vực châu Á – Thái Bình Dương.",
      "Trong nước, đổi mới vẫn còn nhiều hạn chế: tăng trưởng chưa bền vững, năng suất lao động thấp, nợ công cao, chênh lệch giàu nghèo lớn; tình trạng tham nhũng, suy thoái đạo đức, “tự diễn biến, tự chuyển hóa” trong một bộ phận cán bộ, đảng viên gây bức xúc xã hội.",
      "Tình hình thế giới và khu vực diễn biến rất nhanh, phức tạp, khó lường… Trong nước, sau 30 năm đổi mới, đất nước ta đã đạt được những thành tựu to lớn, có ý nghĩa lịch sử; song kinh tế vẫn phát triển chưa bền vững, năng suất lao động và sức cạnh tranh còn thấp; tham nhũng, lãng phí, suy thoái về tư tưởng chính trị, đạo đức, lối sống trong một bộ phận cán bộ, đảng viên chưa được đẩy lùi."
    ],
    "contentHighlights": [
      {
        "title": "Chủ đề Đại hội",
        "description": "- Tăng cường xây dựng Đảng trong sạch, vững mạnh;\n - Phát huy sức mạnh toàn dân tộc và dân chủ xã hội chủ nghĩa;\n - Đẩy mạnh toàn diện, đồng bộ công cuộc đổi mới;\n - Bảo vệ vững chắc Tổ quốc, giữ vững môi trường hòa bình, ổn định;\n - Phấn đấu sớm đưa nước ta cơ bản trở thành nước công nghiệp theo hướng hiện đại."
      },
      {
        "title": "6 nhiệm vụ trọng tâm",
        "description": "1. Xây dựng, chỉnh đốn Đảng.\n 2. Xây dựng bộ máy tinh gọn. \n 3. Đổi mới mô hình tăng trưởng.\n 4. Phát triển văn hóa, con người.\n 5. Giữ vững quốc phòng, an ninh.\n 6. Chủ động hội nhập quốc tế."
      },
      {
        "title": "Các nghị quyết tiêu biểu",
        "description": "- Nghị quyết 04 (2016) về chỉnh đốn Đảng;\n - NQ 10, 11, 12 (2017) về thể chế kinh tế thị trường và doanh nghiệp nhà nước;\n - NQ 18, 19 (2017) về tinh gọn bộ máy;\n - NQ 26, 27, 28 (2018) về cán bộ, tiền lương, bảo hiểm xã hội;\n - NQ 36 (2018) về kinh tế biển."
      }
    ],
    "fullContentSummary": [
      "### Văn kiện và nội dung cơ bản của Đại hội XII\n\n**Chủ đề Đại hội:**  \n> “Tăng cường xây dựng Đảng trong sạch, vững mạnh;  \nPhát huy sức mạnh toàn dân tộc và dân chủ xã hội chủ nghĩa;  \nĐẩy mạnh toàn diện, đồng bộ công cuộc đổi mới;  \nBảo vệ vững chắc Tổ quốc;  \nPhấn đấu sớm đưa nước ta cơ bản trở thành nước công nghiệp theo hướng hiện đại.”  \n\nLần đầu tiên Đảng đặt **xây dựng Đảng trong sạch, vững mạnh** lên hàng đầu.",

      "### Văn kiện thông qua\n- Báo cáo chính trị của Ban Chấp hành Trung ương khóa XI.  \n- Báo cáo phát triển kinh tế – xã hội 2011–2015, phương hướng 2016–2020.  \n- Tổng kết **Cương lĩnh 2011** và **Điều lệ Đảng khóa XI.**  \n→ Nhấn mạnh: **Phát triển kinh tế tư nhân** là **một động lực quan trọng** của nền kinh tế thị trường định hướng XHCN.",

      "### Sáu nhiệm vụ trọng tâm\n1. **Xây dựng, chỉnh đốn Đảng** – chống suy thoái, “tự diễn biến, tự chuyển hóa”.  \n2. **Tinh gọn bộ máy nhà nước** – cải cách hành chính.  \n3. **Đổi mới mô hình tăng trưởng**, nâng cao năng suất, hiệu quả.  \n4. **Phát triển văn hóa, con người Việt Nam.**  \n5. **Giữ vững quốc phòng, an ninh, trật tự xã hội.**  \n6. **Chủ động, tích cực hội nhập quốc tế.**",

      "### Các Hội nghị Trung ương tiêu biểu\n- **TW4 (2016):** NQ 04 – *Tăng cường xây dựng, chỉnh đốn Đảng* → mở đầu chiến dịch chống tham nhũng toàn diện.  \n- **TW5 (2017):** NQ 10, 11, 12 – *Kinh tế tư nhân, thể chế thị trường, doanh nghiệp nhà nước.*  \n- **TW6 (2017):** NQ 18, 19 – *Tinh gọn bộ máy, đổi mới đơn vị sự nghiệp công.*  \n- **TW7 (2018):** NQ 26, 27, 28 – *Công tác cán bộ, tiền lương, bảo hiểm xã hội.*  \n- **TW8 (2018):** NQ 36 – *Chiến lược phát triển bền vững kinh tế biển.*",

      "### Ý nghĩa và tầm vóc Đại hội XII\n- **Đánh dấu bước chuyển** từ *đổi mới thể chế* sang *đổi mới toàn diện, đồng bộ.*  \n- **Khẳng định vai trò lãnh đạo trung tâm của Đảng.**  \n- **Lần đầu tiên kinh tế tư nhân được coi là “một động lực quan trọng”.**  \n- **Đặt nền tảng cho Đại hội XIII**, định hướng phát triển đến **năm 2045.**"
    ],

    "significance": [
      "Đại hội XII đánh dấu bước chuyển từ đổi mới thể chế sang đổi mới toàn diện, đồng bộ.",
      "Khẳng định vai trò lãnh đạo trung tâm của Đảng trong ổn định chính trị và phát triển đất nước.",
      "Lần đầu tiên kinh tế tư nhân được xác định là 'một động lực quan trọng' của nền kinh tế.",
      "Đại hội XII chuẩn bị nền tảng cho Đại hội XIII, định hướng phát triển đất nước đến năm 2045."
    ],
    "media": {
      "images": [
        {
          "src": "/images/dai-hoi-12-1.jpg",
          "caption": "Hình ảnh minh họa bối cảnh toàn cầu hóa"
        }
      ],
      "videoUrl": "/video/daihoi12.mp4"
    }
  },
  "XIII": {
    "id": "XIII",
    "title": "Đại hội đại biểu toàn quốc lần thứ XIII",
    "time": "25/01 - 01/02/2021",
    "location": "Hà Nội",
    "heroImage": "/images/dai-hoi-13-1.jpg",
    "context": [
      "Quốc tế: Tình hình thế giới chuyển biến sâu sắc dưới tác động của cách mạng công nghiệp 4.0, biến đổi khí hậu, và đặc biệt là đại dịch COVID-19 bùng phát toàn cầu.",
      "Cạnh tranh chiến lược giữa các nước lớn gay gắt, chủ nghĩa bảo hộ, dân túy gia tăng.",
      "Trong nước: Sau 35 năm đổi mới, Việt Nam đã đạt được những thành tựu to lớn, có ý nghĩa lịch sử, 'đất nước phát triển nhanh, bền vững hơn; vị thế và uy tín quốc tế ngày càng củng cố'.",
      "Tuy nhiên, kinh tế phát triển chưa bền vững, năng suất lao động thấp; tham nhũng, suy thoái, 'tự diễn biến' vẫn chưa được đẩy lùi triệt để."
    ],
    "contentHighlights": [
      {
        "title": "Khát vọng 2045",
        "description": "Lần đầu tiên đưa **khát vọng phát triển đất nước phồn vinh, hạnh phúc** vào chủ đề Đại hội.",
        "source": "Mục tiêu 2045: Trở thành nước phát triển, thu nhập cao."
      },
      {
        "title": "Tầm nhìn chiến lược",
        "description": "Đề ra 3 mốc mục tiêu cụ thể: 2025 (vượt qua mức TNTB thấp), 2030 (nước có công nghiệp hiện đại, TNTB cao), 2045 (nước phát triển, thu nhập cao)."
      },
      {
        "title": "Chuyển đổi số",
        "description": "Chiến lược 2021-2030 nhấn mạnh **phát triển nhanh và bền vững dựa chủ yếu vào khoa học, công nghệ, đổi mới sáng tạo và chuyển đổi số**.",
        "source": "Mục tiêu 2030: Kinh tế số chiếm khoảng 30% GDP."
      },
      {
        "title": "Chỉnh đốn Hệ thống Chính trị",
        "description": "Nhiệm vụ trọng tâm số 1 là **Tăng cường xây dựng, chỉnh đốn Đảng và hệ thống chính trị trong sạch, vững mạnh**.",
        "source": "Hội nghị TW 4 (2021) mở rộng phạm vi chỉnh đốn ra toàn bộ hệ thống chính trị."
      },
      {
        "title": "Ba đột phá chiến lược",
        "description": "- Hoàn thiện thể chế phát triển đồng bộ;\n - phát triển nguồn nhân lực, đặc biệt nhân lực chất lượng cao;\n - xây dựng hệ thống hạ tầng đồng bộ, hiện đại.",
        "source": "Văn kiện Đại hội XIII, Tập I, tr.132-133."
      },
      {
        "title": "Kiên định và phát triển sáng tạo chủ nghĩa Mác - Lênin, tư tưởng Hồ Chí Minh",
        "description": "Khẳng định bước phát triển mới trong tư duy lý luận của Đảng - không chỉ kiên định mà còn vận dụng, phát triển sáng tạo chủ nghĩa Mác - Lênin và tư tưởng Hồ Chí Minh trong điều kiện mới."
      }
    ],
    "fullContentSummary": [
      "### Văn kiện và nội dung cơ bản của Đại hội XIII\n\n**Bối cảnh:**  \n- Thế giới biến động sâu sắc do **Cách mạng công nghiệp 4.0**, **COVID-19**, **biến đổi khí hậu.**  \n- Trong nước: Sau **35 năm đổi mới**, đạt nhiều **thành tựu to lớn**, song còn hạn chế về **năng suất, tham nhũng, suy thoái.**",

      "### Chủ đề Đại hội\n> “Tăng cường xây dựng, chỉnh đốn Đảng và hệ thống chính trị trong sạch, vững mạnh;  \nKhơi dậy khát vọng phát triển đất nước phồn vinh, hạnh phúc;  \nPhát huy sức mạnh đại đoàn kết toàn dân tộc;  \nTiếp tục đẩy mạnh toàn diện, đồng bộ công cuộc đổi mới;  \nPhấn đấu đến giữa thế kỷ XXI, nước ta trở thành nước phát triển theo định hướng XHCN.”  \n\n**Ba điểm mới nổi bật:**  \n1. Gắn kết **Đảng và hệ thống chính trị.**  \n2. Đưa **“khát vọng phồn vinh, hạnh phúc”** vào chủ đề.  \n3. Mở rộng **tầm nhìn đến giữa thế kỷ XXI.**",

      "### Ba mốc mục tiêu chiến lược\n- **2025:** Công nghiệp hiện đại, vượt mức thu nhập trung bình thấp.  \n- **2030:** Công nghiệp hiện đại, thu nhập trung bình cao.  \n- **2045:** Nước phát triển, thu nhập cao.",

      "### Năm văn kiện lớn\n1. **Báo cáo chính trị:** kim chỉ nam cho toàn bộ hoạt động 2021–2026.  \n2. **Chiến lược phát triển KT-XH 2021–2030:** nhấn mạnh **khoa học, công nghệ, đổi mới sáng tạo, chuyển đổi số.**  \n3. **Phương hướng KT-XH 2021–2025:** phát triển **kinh tế số, xanh, tuần hoàn, thấp carbon.**  \n4. **Công tác xây dựng Đảng:** kiểm soát quyền lực, chống chạy chức, chạy quyền.  \n5. **Kiểm điểm BCH TW khóa XII:** rút kinh nghiệm cho khóa XIII.",

      "### Sáu nhiệm vụ trọng tâm\n1. **Xây dựng, chỉnh đốn Đảng và hệ thống chính trị trong sạch, vững mạnh.**  \n2. **Hoàn thiện thể chế**, phát huy dân chủ XHCN.  \n3. **Đổi mới mô hình tăng trưởng**, gắn **CNH – HĐH** và **kinh tế số.**  \n4. **Phát triển văn hóa, con người Việt Nam.**  \n5. **Tăng cường quốc phòng, an ninh.**  \n6. **Hội nhập quốc tế sâu rộng, hiệu quả.**",

      "### Các Hội nghị Trung ương khóa XIII\n- **TW4 (2021):** Mở rộng chỉnh đốn ra **toàn hệ thống chính trị.**  \n- **TW5 (2022):** NQ 18, 19, 20 – *Thể chế, Nông nghiệp, Kinh tế tập thể.*  \n- **TW6 (2022):** *Tinh gọn bộ máy, cải cách tài chính.*  \n- **TW7 (2023):** *Giáo dục, khoa học – công nghệ, phát triển con người.*  \n- **TW8 (2023):** *Chiến lược bảo vệ Tổ quốc trong tình hình mới.*  \n- **TW9 (2024):** *Tổng kết giữa nhiệm kỳ, chuẩn bị Đại hội XIV.*",

      "### Ý nghĩa và tầm vóc Đại hội XIII\n- **Đại hội của “Khát vọng phát triển đất nước phồn vinh, hạnh phúc.”**  \n- **Đại hội của chuyển đổi số, đổi mới sáng tạo, phát triển bền vững.**  \n- **Khẳng định bước phát triển lý luận:** từ *kiên định* đến *phát triển sáng tạo* chủ nghĩa Mác – Lênin, tư tưởng Hồ Chí Minh.  \n- **Đặt nền tảng chiến lược cho tầm nhìn 2045**, chuẩn bị **Đại hội XIV.**"
    ],
    "significance": [
      "Đại hội XIII là Đại hội của 'Khát vọng phát triển đất nước phồn vinh, hạnh phúc', thể hiện tư duy phát triển mới của Đảng.",
      "Khẳng định bước phát triển lý luận quan trọng: từ 'kiên định' đến 'phát triển sáng tạo' chủ nghĩa Mác - Lênin và tư tưởng Hồ Chí Minh.",
      "Là Đại hội của chuyển đổi số, đổi mới sáng tạo và phát triển bền vững, đưa Việt Nam vào thời kỳ kinh tế số - xã hội số.",
      "Đặt nền tảng chiến lược cho tầm nhìn 2045, chuẩn bị trực tiếp cho Đại hội XIV."
    ],
    "media": {
      "images": [
        {
          "src": "/images/dai-hoi-13-1.jpg",
          "caption": "Tổng Bí thư, Chủ tịch nước Nguyễn Phú Trọng đọc Báo cáo chính trị tại Đại hội XIII"
        }
      ],
      "videoUrl": "/video/daihoi13.mp4"
    }
  }
}
